[
  {
    "title": "Nathan Fillion's Green Lantern Is a 'Jerk' In James Gunn's Upcoming Superman: 'You Don't Have To Be Good'",
    "publishedAt": "2025-03-19T17:05:09Z",
    "url": "https://www.ign.com/articles/nathan-fillions-green-lantern-is-a-jerk-in-james-gunns-upcoming-superman-you-dont-have-to-be-good",
    "full_text": "There’s a whole new version ofSupermanon the horizonfrom James Gunn, and with it comes Nathan Fillion’s Green Lantern. The actor opened up about how his version of Guy Gardner will be different from other film and small screen versions — and it turns out he isn’t exactly going to be the most charming iteration of the character.\n\n\"He's a jerk!\" Fillion toldTV Guidein a recent interview. \"What's important to know is,you don't have to be good to be a Green Lantern; you just have to be fearless. So Guy Gardner is fearless, and he is not very good. He's not nice, which is very freeing as an actor because you just think to yourself, what is the most selfish, self-serving thing I can do in this moment? And that's the answer. That's what you do in that moment.”\nFillion even added that Gardner’s superhero alter ego has a bit of a hubris issue. “I think if he has a superpower, it might be his overconfidence, in that he thinks he could take on Superman,” the actor explained. “He can't!\"\nThe upcoming Superman isthe first film entry in an entirely rebooted DC Cinematic Universeand will helm the inaugural chapter ofthe new DCU, titled Gods and Monsters. But the DC establishment isn’t the only one interested in the Green Lanterns. HBO is also currently shooting a series-style look at the other members of the superhero alliance calledLanterns, with Kyle Chandler playing Hal Jordan and Aaron Pierre playing John Stewart. As of now, that show is set to premiere in 2026.\nSuperman starsDavid Corenswet as Clark Kent, Rachel Brosnahan as Lois Lane, Milly Alcock as Supergirl, and Nicholas Hoult as Lex Luthor. The film was written and directed by James Gunn, and is set to fly into theaters on July 11, 2025.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Disney Pixar's Coco Is Getting a Sequel",
    "publishedAt": "2025-03-21T13:48:33Z",
    "url": "https://www.ign.com/articles/disney-pixars-coco-is-getting-sequel-coco-2-in-development-reveals-bob-iger",
    "full_text": "It’s official: 2017’s animated hitCocowill, in fact, be getting a sequel — Coco 2 is in the works!\n\n“While the film is just in the initial stages, we know it will be full of humor, heart and adventure,” Disney CEOBob Igerrevealed of the film's development as part of The Walt Disney Company’s annual meeting of shareholders. “And we can't wait to share more soon.”\nCoco was critically acclaimed at the time of its release and managed to take home two Academy Awards, one for best animated feature and another for best song for the original track “Remember Me.” The film also won a handful of other prestigious awards, including the Golden Globe for best animated feature, a BAFTA for best animated film, and two Critics Choice Awards for best animated feature and best song.\nNaturally, Coco 2 will bring back the team behind the original film, including director Lee Unkrich, who is also known for directingToy Story 3, and co-director Adrian Molina.Toy Story 4andInside Out 2producer Mark Nielsen will produce the project.\nIt’s clear that Disney-Pixar deeply believes in the overall Coco franchise following the first film. Back in August 2024, the company revealed that the movie would be getting its veryfirst Disney Parks attraction at Disneyland’s Disney California Adventure. According to the concept art Disney revealed at the time, it seems the attraction will feature tons of beloved Coco characters and resemble something like their iconic Pirates of the Caribbean ride in its style and presentation. The ride is set to become part of the Disney experience sometime in 2026.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Disney+ Reveals a 24/7 Simpsons Stream With Nearly the Entire Show to Binge Watch",
    "publishedAt": "2025-03-18T16:52:26Z",
    "url": "https://www.ign.com/articles/disney-reveals-247-simpsons-stream-with-nearly-entire-show-to-binge-watch",
    "full_text": "Do you like fun, reader? Then you might just enjoy this cute little piece of news: as of today, streaming serviceDisney+now has a 24/7 streaming channel solely forThe Simpsons. Yep, all Simpsons, all the time.\n\nAccording to the Walt Disney Company, the “always-on” streamincludesa whopping 767episodes of the beloved animated series. That means seasons one through 35 are available to binge — and Season 35 just completed in May 2024, so this is nearly the entire Simpsons catalog.\nThe episodes will be programmed in chronological order on the stream at the time of launch, and the channel will ultimately consist of an incredible 300 hours of Homer, Marge, Lisa, Bart, and Maggie. The company also noted that the stream will be “refreshed monthly” and specifically available to premium subscribers.\nIt’s cool to see The Simpsons being honored in this way, especially at a time when the show has shifted a bit from what it once was. Back in November 2024, Pamela Hayden, who is best known as the voice of Bart’s BFF Milhouse Van Houton,retired from the series after 35 yearsvoicing many of Springfield’s most notable residents. Hayden was also the voice behind Jimbo Jones and Rod Flanders, among many others. As of now, it’s unclear if Milhouse and Hayden’s other characters will be recast or written off the series entirely — but one thing is for sure, Hayden will not be part of the series going into season 37.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "South Park Finally Announces Season 27 Release Date With a Typically Topical Trailer",
    "publishedAt": "2025-04-02T17:40:50Z",
    "url": "https://www.ign.com/articles/south-park-finally-announces-season-27-release-date-with-a-typically-topical-trailer",
    "full_text": "The boys are back in town — and by the boys, I mean Stan, Kyle, Kenny, and Cartman.South Parkhas finally announced a return for Season 27, and it looks as though our favorite Colorado crew is dealing with, well, the state of things. And by dealing with it, I mean barely.\n\nThe beloved animated seriesdebuted a new trailerannouncing the upcoming season, but cleverly psyched the audience into thinking it was a dramatic sneak peek at a new drama. The intense editing and music added to the ominous vibes... until Stan’s dad Randy and his sister Shelley pop up on-screen and he asks her if she’s been taking drugs. “Because I think it could really help you,” he says as they sit on her bed with a Wicked movie poster in the background.\nThe visual heads back to intense action following the gag, seemingly teasing several big (and topical) moments from the season, like several major plane crashes, the Statue of Liberty being pulled down, a P. Diddy appearance, and some kind of war with Canada. To be fair, you’ve probably been expecting that last one if you’re a longtime fan of the show, or even if you’ve just seen the 1999 film South Park: Bigger, Longer, and Uncut.\nThe teaser also reveals that the season will premiere on July 9, 2025 on Comedy Central, over two years after the end of Season 26. The series has aired three specials since then: 2023’s South Park: Joining the Panderverse and South Park (Not Suitable For Children), and 2024’s South Park: The End of Obesity.\nSouth Park celebrated its 25th anniversary in 2022, having debuted on Comedy Central to near-instant acclaim back in 1997.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Friends Star David Schwimmer Couldn't Listen To the Iconic Theme Song After the Show Ended: 'I Just Had That Reaction'",
    "publishedAt": "2025-04-03T15:25:39Z",
    "url": "https://www.ign.com/articles/friends-star-david-schwimmer-couldnt-listen-to-the-iconic-theme-song-after-the-show-ended-i-just-had-that-reaction",
    "full_text": "ForFriendsalum David Schwimmer, the iconic \"I'll Be There for You\" theme song we all know and love had worn out its welcome by the time the show ended its 10 season run in 2004.\n\n\"I'll Be There for You\" by American pop rock duo the Rembrandts set up each episode of Friends during its entire decade-long domination of global TV. It became one of best-known and most-listened to songs in the world, and remains in the public consciousness today as Friends continues to pull in viewers on streaming platforms.\n“I’ll be really honest, there was a time for quite a while that just hearing the theme song would really… ”  he recently told Matt Lucas and David Walliams on their podcastMaking a Scene. “I just had that reaction. I mean, I just had heard it so many times.”\nNaturally with the show in syndication, he was bound to be exposed to it quite a bit over the years — but according to Schwimmer, the music was everywhere beyond those classic apartment walls. “Any time you’d go on a show or a talk show or an interview, that would be your intro song,” he added. “So I just didn’t have the greatest response to it.”\nThe legendary sitcom star, who is perhaps best known for his role as Ross Geller on the show, also revealed that he never returned to the series to even watch an episode or two following its end. That is, until his daughter Cleo “discovered it around age nine or something.”\n“For me, it’s like, I did it, I’m moving on. I don’t really go back and revisit,” he said, before adding about his change of heart. “I’d be making breakfast or whatever and I’d hear my kid’s laughter. My whole relationship to that song and to the show changed.”\nTo be fair, we probably wouldn’t ever want to hear that song again either if we were him. Friends aired its finale episode on May 6, 2004 after 10 years on NBC. A reunion special Friends: The Reunion aired in 2021 on HBO. The entire series and the special are available to stream now on MAX.\nPhoto by Robert Isenberg/NBCU Photo Bank/NBCUniversal via Getty Images via Getty Images.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Was That a Herobrine Easter Egg in A Minecraft Movie? Producer Responds",
    "publishedAt": "2025-04-07T17:28:57Z",
    "url": "https://www.ign.com/articles/was-that-a-herobrine-easter-egg-in-a-minecraft-movie-producer-responds",
    "full_text": "If you’re a Minecraft die-hard, you might have seen one particularly sneaky Easter egg in the new film adaptationA Minecraft Movie— but all is not what it seems. According to Mojang Studios Senior Creative Director of Entertainment and producer on A Minecraft Movie, Torfi Frans Olafsson, that moment that seemed to be alluding to the 2010 Creepypasta storyHerobrineisn't an Easter egg, but a mistake the visual effects team ran out of time to fix.\n\nWarning!Spoilers for A Minecraft Movie follow:\nFor context, A Minecraft Movie has a scene that takes place at the Woodland Mansion where Henry (Sebastian Hansen) meets an Enderman who puts him in a state where he’s able to see a vision of Steve (Jack Black), except the character is verbally berating him as his eyes go white. Because Herobrine is characterized as Steve with white eyes, fans were convinced that the moment signified that there was a future for the Creepypasta story within the MCU (Minecraft Cinematic Universe, duh).\nHowever, Olafsson has cast doubt on this assumption. \"It’s super strange that all of their eyes were supposed to be purple but when it was rendered one of the characters eyes kept coming out white in the final rendered frames so we wound up keeping it like that, because the VFX studio ran out of time,\" he revealed onX / Twitter.\nIn the early Minecraft days, an anonymous poster on 4chan claimed they saw an in-game version of Steve with white eyes and weird powers showing up around the game. Following the post,a Creepypasta storysurfaced, which “revealed” that the character anomaly was actually the spirit of a dead player.\nOlafsson's comment is being taken by many fans as a knowing wink to this being a genuine Herobrine Easter egg in A Minecraft Movie. After all, the joke is that it's an unfixable error, that Herobrine appears and can't be removed.\nWe’ve got plenty more on A Minecraft Movie, includinghow rowdy fans are creating wild scenes in the cinema, causing some to say it’s ruining their experience.\nIGN’sA Minecraft Movie reviewreturned a 6/10. We said: “Napoleon Dynamite director Jared Hess puts a surprisingly specific and funny comic spin on A Minecraft Movie’s kid-friendly adventure, especially in its less antic first half.”\nIf you’ve seen the film, be sure to check out IGN’sA Minecraft Movie Ending and Post-Credits Scene ExplainedWith Director Jared Hess and Minecraft's Torfi Frans Ólafsson.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Saw XI 'Stalled at a Managerial Level' Due to Lionsgate and Producer Tensions",
    "publishedAt": "2025-03-18T13:29:15Z",
    "url": "https://www.ign.com/articles/saw-xi-quietly-cancelled-due-to-lionsgate-and-producer-tensions-stalled-at-managerial-level",
    "full_text": "I can’t even believe I’m saying this but... it’s game over for the Saw franchise, at least for now. It has been confirmed that the upcomingSaw XIhas officially been stalled and, at this point, will not be released in the fall as originally scheduled.\n\nThat said, this isn’t a creative issue. “We haven’t heard anything since May,” Saw XI screenwriter Patrick Melton toldThe Hollywood Reporter. “It’s stalled at a managerial level. It has nothing to do with the creative or anything else. There’s higher-level things at play.”\nAccording to the publication, Melton and his writing partner Marcus Dunstan submitted a draft of the script in spring 2024, which is coming up on a year ago. Melton added: “The reason it’s held up is just, there’s inter-squabbling between producers and Lionsgate. They just can’t quite get on the same page.”\nFrequent franchise director Kevin Gruetert wasattached to the project back in December 2023, when it was given a September 2024 release date. But fans were gutted when the film was ultimatelydelayed for an entire year, with a new September 2025 release date in place. Franchise diehards hoped it was for the greater good of the story, especially after the box office success that wasSaw X. The 10th installment had really brought the franchise back to life in numbers terms, garneringover $120 million globallyduring its theatrical run, which naturally had execs itching to make Saw XI.\nWhat’s worse is the 11th installment was set to deal with a timely topic. Though plot details have not been made public for Saw XI, Melton compared the plot of the film to that ofSaw VI, which was written by Melton and Dunstan and directed by Gruetert. In it, lead John Kramer, aka Jigsaw (Tobin Bell), takes revenge on a group of health insurance executives.\n“Saw XI may or may not be made, but we have a very timely story in it, and I hope it gets made just because of that,” Melton told THR.\n“It taps into the same themes of Saw VI, where you’re a citizen, you feel angry and frustrated with something, you feel like you can’t do anything, and John Kramer’s going to do it.” It would be quite interesting to see the Saw franchise go down this road again and how they would do it differently, considering the state of the world at the moment — but sadly, it seems we may never know.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Jason Isaacs Has a Surprising Pick for Who Should Play Lucius Malfoy in HBO's Harry Potter TV Series",
    "publishedAt": "2025-03-25T15:17:26Z",
    "url": "https://www.ign.com/articles/jason-isaacs-has-a-surprising-pick-for-who-should-play-lucius-malfoy-in-hbos-harry-potter-tv-series",
    "full_text": "Thailand is far from Hogwarts, no doubt, butThe White LotusSeason 3 star Jason Isaacs still has some thoughts on who should take over his role as Lucius Malfoy inHBO’s upcoming Harry Potter TV series.\n\n“Meryl Streep,” the What If…? voice actor revealed as his choice toVarietyin a new interview focused on The White Lotus.\n“She can do anything, that woman. There’s literally no limit to what she can do.” Streep has actually played a man once before; she portrayed several characters in the HBO miniseries version of the epic play Angels in America, one of which was an elderly male rabbi. So, honestly, she could probably pull this off.\nThat said, Isaacs doesn’t have any advice for her, or anyone who might end up stepping into his role. “I wouldn’t have any advice at all. Why would I bother?” he said. “I know some of the people they’re casting already. They’re brilliant actors. It’s going to be fantastic, and the last thing they need is advice from some old fart like me.”\nIsaacs debuted as Lucius Malfoy in the second Harry Potter film,Harry Potter and the Chamber of Secrets, and then reprised that role in the fourth film,Harry Potter and the Goblet of Fire, onward through to the final installment,Harry Potter and the Deathly Hallows Part 2. As for this upcoming adaptation, there is only one confirmed casting choice at the time of publishing this story.\nJohn Lithgow is set to star as Albus Dumbledore, originally played by Richard Harris and then Michael Gambon, in the upcoming series. The only other roles that seem close to being cast are professors Severus Snape, originally played by Alan Rickman, and Minerva McGonagall, originally played by Maggie Smith. Black Mirror starPaapa Essieduisreportedly close to being cast as Snape, while Jessica Jones star Janet McTeer is allegedly close to being cast as McGonagall — but there are no official confirmations for those roles just yet.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Atari 2600 Plus Console is Exclusively 50% off at Amazon UK Today",
    "publishedAt": "2025-03-21T11:40:26Z",
    "url": "https://www.ign.com/articles/atari-2600-plus-console-amazon-uk-deals",
    "full_text": "While gaming has moved forward with bigger and more powerful consoles, theAtari 2600 Plusoffers a way to revisit the era of classic cartridge gaming. Right now, it'savailable for £50.13—half its usual price of £99.99—at its exclusive UK retailer, Amazon.\n\nReleased in November 2023, theAtari 2600 Plusmodernizes the original console’s design while maintaining compatibility with both Atari 2600 and 7800 cartridges. It connects easily to modern TVs via HDMI and includes a widescreen mode to better fit contemporary screens.\nIf you still have old cartridges like Space Invaders or Asteroids, they’ll run just as you remember. The system also comes with a CX40+ Joystick Controller, faithfully recreating the original’s design, along with a 10-in-1 cartridge featuring titles like Combat, Missile Command, and Yars’ Revenge:\nFor those looking to expand their collection, a second joystick is available separately for multiplayer games, and the 4-in-1 Game Cartridge Plus Paddle Pack adds titles like Breakout and Night Driver.\nWith its mix of nostalgia and modern convenience, the Atari 2600 Plus makes it easy to revisit classic games. And with this price drop, it’s a good time to pick one up.\nIn ourAtati 2600 Plus review, IGN's Seth Macy had this to say: \"Every time I walk past the Atari 2600+ sitting on the floor of my living room, controllers and games scattered around it, I'm instantly transported to the 1980s. Everything about its design is painstakingly authentic to the original while making necessary updates to bring it into the modern era. Atari collecting is easier than newer systems, but playing those carts has always been a bit tough since the original hardware was designed for an era when few TVs had coax inputs, much less composite video.\"\n\"Being able to output to HDMI makes playing your original carts a snap, although seeing Combat on a 65\" 4K screen doesn't really add anything to the experience. The Atari 2600+ is a fantastic upgrade to the original hardware that stays faithful to the original where it counts the most. Part of me wishes it had wireless controllers, but the other part of me knows that would take away from the experience I remember as a little kid in front of a 13\" black & white tube television. And ultimately, the Atari 2600+ is about taking you back.\"\nBen Williams– IGN freelance contributor with over 10 years of experience covering gaming, tech, film, TV, and anime. Follow him on Twitter/X@BenLevelTen."
  },
  {
    "title": "X-Men Star Halle Berry Shuts Down Hopes She Might Return as Storm for Avengers: Doomsday: 'Keep Waiting'",
    "publishedAt": "2025-04-03T16:16:54Z",
    "url": "https://www.ign.com/articles/x-men-star-halle-berry-shuts-down-hopes-she-might-return-as-storm-for-avengers-doomsday-keep-waiting",
    "full_text": "With the overwhelming amount of actors jumping intothe Avengers: Doomsday cast— like, hello, did you see the livestream?! — it’s a pretty natural step to think that maybe, just maybe, Halle Berry would return to theX-Menand reprise her iconic role asStorm. Sadly, it seems as though that beautiful theory willnotbe working out the way fans hoped.\n\n“We want to see your name on a chair for Avengers: Doomsday, we want Storm,”Black Girl Nerds told Berry on the red carpet at CinemaCon in Las Vegas recently, to which the Never Let Go star replied with a chuckle and: “keep waiting. Not gonna be there.”\nFans have been eager to see Berry make her first official appearance in the MCU as it stands today, even before the Avengers: Doomsday cast reveal. She first appeared as Ororo Munroe, also known as Storm, inBryan Singer’s 2000 adaptation of X-Men, where she starred alongside a now iconic ensemble cast of Patrick Stewart, Ian McKellen, Hugh Jackman, James Marsden, Anna Paquin, Rebecca Romjin, Ray Park, Famke Janssen, and Bruce Davidson. She went on to reprise her role in 2003’s X2, 2006’s X-Men: The Last Stand, and 2014’s X-Men: Days of Future Past.\nEach of these films were produced by 20th Century Fox before they were purchased by Disney and integrated into the current MCU — so fans seemed to be really holding out hope that she would finally make an official appearance within Marvel’s new world.\nThen came last month's Avengers: Doomsday cast reveal, which was heavy on veteran X-Men actors. Kelsey Grammer, Patrick Stewart, Ian McKellen, Alan Cumming, Rebecca Romijn, and James Marsden are all now set to appear in Avengers: Doomsday, confirming the X-Men are in the film in a big way. Grammer famously played Beast in the Fox X-Men franchise beforemaking his MCU debut via The Marvels' post-credits scene. Stewart played Charles Xavier/Professor X in the X-Men films before appearing briefly in the MCU via Doctor Strange in the Multiverse of Madness as a member of the Illuminati. McKellen, who played Magneto, has yet to appear in the MCU. Neither has Cumming, who played Nightcrawler, Romijn, who played Mystique, nor Marsden, who played Cyclops. It begs the question:is Avengers: Doomsday secretly an Avengers vs. X-Men movie?\nAnd then,Marvel and Robert Downey Jr. teased they’re not done yet, which led fans to believe the likes of Halle Berry and other former X-Men actors who didn't make the cut still had a chance.\nBerry's next official appearance on the big screen, however, is a film called Crime 101, featuring Chris Hemsworth, Mark Ruffalo, Barry Keoghan, Monica Barbaro, Jennifer Jason Leigh, and Nick Nolte. It is said to be releasing sometime this year.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Zenless Zone Zero Voice Actors Say They Found Out They Were Replaced When the Patch Notes Went Live",
    "publishedAt": "2025-03-12T13:46:45Z",
    "url": "https://www.ign.com/articles/zenless-zone-zero-voice-actors-say-they-found-out-they-were-replaced-when-the-patch-notes-went-live",
    "full_text": "TwoZenless Zone Zerovoice actors discovered they had been replaced when the game'spatch noteswent live, they have claimed, in the latest casualty of the battle for generative AI protections.\n\nThe Screen Actors Guild–American Federation of Television and Radio Artists' (SAG-AFTRA) ongoing dispute with the video game industry revolves around the use of generative AI to replicate voice actor performances.\nZZZ, developed by Genshin Impact company HoYoverse, is not subject to the strike because it was in development before July 25, 2024, when the strike began. However, voice actors may choose not to sign new contracts in solidarity with striking union members, or in the absence of a SAG Interim Agreement.\nEmeri Chase — who portrays Soldier 11 — said they were \"replaced as Soldier 11 because I am unwilling to perform work not covered by a SAG Interim Agreement during a strike for AI protection, the outcome of which will determine the future of our industry.\" Nicholas Thurkettle, who played Lycaon, has been similarly replaced, although Thurkettle is not a union member.\n\"I'd like to clarify that there's a difference between being 'struck' and not being on an Interim Agreement,\" Chase explained in a thread onBluesky(thanks,Eurogamer). \"Union projects that began work prior to the strike and non-union projects are not 'struck.' But they also do not offer the Union-enforced AI rights we are fighting for.\n\"Many actors are choosing to voluntarily withhold work on these categories of projects because we feel it is the best way to support the union's fight for the protections that are critical to our continued ability to create the art we love.\"\nChase added that they knew \"that by withholding work it was possible\" they'd be replaced, but had \"hoped [developer HoYoVerse] would choose to leave her silent until I was able to return.\"\n\"I found out the role was recast today alongside all of you,\" Chase said, while Thurkettle stated: \"I'm learning about this as you are, and I share your shock. Neither HoYoverse nor Sound Cadence has communicated with me since October. I've been fully available and recorded multiple voice jobs in that time.\n\"I'm not SAG but what game companies want to do with AI is an existential threat. I took a personal stand to ask for protection, and had to be willing to give up the best thing that's ever happened in my professional life. I stand by my choice.\"\nIGN has asked HoYoVerse for comment.\nIn a similar case from December,Activision confirmed it had recast some members of the Call of Duty: Black Ops 6 castafter fans noticed much-loved Zombies characters with new voices in-game.\nThe company issued a statement toGame Developeradmitting characters in Black Ops 6’s Zombies mode were recast amid the ongoing SAG-AFTRA strike.\nZombies characters William Peck (Zeke Alton) and Samantha Maxis (Julie Nathanson) are currently voiced by new, unknown actors. Alton told Game Developer that he took no issue with Activision’s actions with Peck, but expressed concern “for my brand as a performer.”\n“Fans of the game have reached out to me because the lack of crediting [of the replacement actor] implies that it may still be me which unfairly represents my abilities as a performer,\" Alton said at the time.\nFor more on how the strike has, and will continue to, affect the games you play, check out our feature from last year,What the SAG-AFTRA Video Game Actors Strike Means for Gamers.\nVikki Blake is a reporter, critic, columnist, and consultant. She's also a Guardian, Spartan, Silent Hillian, Legend, and perpetually High Chaos. Find her atBlueSky."
  },
  {
    "title": "Breaking Bad's Giancarlo Esposito Was Originally Asked to Play King Cobra In Captain America: Brave New World",
    "publishedAt": "2025-03-18T15:28:11Z",
    "url": "https://www.ign.com/articles/breaking-bads-giancarlo-esposito-originally-asked-to-play-king-cobra-captain-america-brave-new-world",
    "full_text": "One of the most fun things about movie-making is remembering all of those little things that almost were and could have been. So many things change in pre-production, post-production, and even the actual production itself — and forCaptain America: Brave New World, one of those things was the role Giancarlo Esposito was going to play.\n\nEsposito ultimately played Sidewinder in the film, but was originally approached to play King Cobra. The Breaking Bad legend revealed toEmpirein a recent interview (via Collider) that producer Nate Moore hadoriginally asked him to portray Klaus Voorhees’ alter ego.\n\"If I'm walking around the neighborhood, African-Americans go, 'What's up, King?' I love it. They call me King, baby! I mean, that's the highest honor,\" Esposito recalled thinking in those early days. \"But as it turned out, there [are other Kings] in the Marvel world, and this was connected to the Serpent Society — they were going back to the comics and trying to figure it out, and Nate said, 'We can give you all the characteristics of King, but we think he should be Sidewinder.' \"\nVoorhees appears in the Captain America comics as a former convict who has to contend with a radioactive snake bite after his murder plot to axe colleague Professor Ezekiel Schektor doesn’t quite go as planned, hence the name King Cobra. In his time on the page, he has battled the likes of Mr. Fantastic, Thor, and Daredevil, as well as Cap and Falcon.\nThat said,the creatives behind Brave New Worldultimately had Esposito play Sidewinder, aka Seth Voelker, an economics professor who gets chemically mutated by the Roxxon Oil Company and becomes a crime boss and the leader of Serpent. Over the years, he’s had major face-offs with Scarlet Witch, The Thing, Triton, and Stingray — but now he’s having one with Cap himself.\n\"They spoke about creating a character that was really grounded, in a mercenary fashion,” Esposito added, noting that the character was shaped inthe film's robust reshoots. “They wanted to ground the movie when they went back in to do some additional shooting, and their focus now was on this additional character. So it was a bit of a whirlwind for me. I focused myself and I went in there and knocked it out.\"\nAs for the character’s future in the MCU, it seems at least Esposito wants him to stick around. \"I'm hoping to be in this universe a little longer,\" he said.\nIt’s no secret thatCaptain America: Brave New Worlddidn’t exactly light the world on fire in terms ofcritical response, fan response, or box office. Check out IGN's feature,Captain America: Brave New World’s Real Budget? You’ll Never Know… and This Is Why, to find out more.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Unedited Batgirl Movie Fight Scene Pulled Offline Just Hours After It Leaked on Social Media",
    "publishedAt": "2025-03-20T14:41:21Z",
    "url": "https://www.ign.com/articles/unedited-batgirl-movie-fight-scene-leaked-taken-down-from-social-media",
    "full_text": "An unedited fight scene fromthe scrapped Batgirl moviewas pulled offline after it surfaced on social media on March 19.\n\nX / Twitter account DC Film Newsposted the now-deleted videoaround 8pm Eastern time and captioned the post: “A look behind the scenes of the fight choreography for ‘BATGIRL’.” The caption also credited stunt performers Emily Cartagena, Scott Rogers, and Stephen Dunlevy for their work in the clip.\nA look behind the scenes of the fight choreography for ‘BATGIRL’.Stunt performers: Emely Cartagena, Scott Rogers, & Stephen Dunlevy.pic.twitter.com/2fJmFsFXc1\nTheraw footage— which made no effort to hide harness cables, clearly proving this clip was far from finished — showedLeslie Grace as Barbara Gordon, aka Batgirl, fighting a group of men in a room, presumably an apartment.\nDespite the men having an advantage in size, she was far from losing the fight. At one point, she smashed through a wall that led to a bathroom on the other side where someone was sitting on the toilet, adding a splash of comedy to the action scene.\nSadly, there’s next to no hope of ever seeing this scene in its final form. Nearly three years ago, Warner Bros. cancelled the release of the Batgirl film, helmed by Ms. Marvel showrunnersAdil El Arbi and Bilall Fallah, amid restructuring two months prior.\nBatgirl would have been next on the now-scrapped DCEU slate if Warner Bros. hadn't cancelled it, coming out ahead of Aquaman and the Lost Kingdom and Joker: Folie à Deux.\nWarnerMedia merged with Discovery Incto become Warner Bros. Discovery in April 2022, which is also when David Zaslav — who was CEO of Discovery Inc prior to the merger — became CEO of WBD. The decision to shelve the practically completed Batgirl film garnered muchbacklash within the industryand also from the general moviegoing public.\nThe movie, which was written by Birds of Prey writer Christina Hodson, was going to follow Gordon as she balanced a double life as Gotham’s head of police Commissioner Gordon’s daughter and a by-night vigilante. Alongside Grace, J.K. Simmons, Brendan Fraser,Michael Keaton, Ivory Aquino, and Jacob Scipico were also set to star.\nLast year,Batman actor Michael Keaton admitted he was not all that bothered about Warner Bros. deciding to scrap the release of Batgirl.GQasked Keaton whether he found the fate of Batgirl disappointing, considering he reprised his iconic Batman role opposite Leslie Grace's titular superhero. The short answer was \"no.\" He was unfazed by the cancellation but did admit to feeling bad for the movie's directors, Adil El Arbi and Bilall Fallah.\n\"No, I didn't care one way or another. Big, fun, nice check,\" Keaton said while, according to the outlet, rubbing his fingers together in a money gesture resembling the act of clutching dollar bills.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "House of the Dragon Season 3 Adds New Faces as Production Begins",
    "publishedAt": "2025-03-31T17:16:35Z",
    "url": "https://www.ign.com/articles/house-of-the-dragon-season-3-adds-new-faces-as-production-begins",
    "full_text": "Production onHouse of the DragonSeason 3 is underway, and HBO is celebrating the milestone with an updated list of new cast members.\n\nThe network announced that the Targaryen-centered Game of Thrones spinoff had begun work on its third season today, revealing all of the familiar names set to make a return alongside a batch of new names, too. No release date for House of the Dragon Season 3 has been announced quite yet, but HBO says that, like Season 2, it is expected to run for eight episodes. The face of dragon queen Rhaenyra Targaryen, Emma D’Arcy, helped kick off day one of filming witha celebratory video for fans.\nThe fight for the Throne is far from over.S3 of#HOTDis now in production.pic.twitter.com/NUe4POwIJM\nD’Arcy will be joined by series veterans Matt Smith (Daemon Targaryen), Olivia Cooke (Alicent Hightower), Steve Toussaint (Corlys Velaryon), and more as Dragonstone and King’s Landing continue their war for the hearts of Westeros – and the Iron Throne.\nJoining them for House of the Dragon Season 3 are newcomers Tommy Flanagan (Sons of Anarchy) as Ser Roderick Dustin and Dan Fogler (Fantastic Beasts and Where to Find Them) as Ser Torrhen Manderly. James Norton, who was previously announced as another fresh face for Season 3, has been brought onboard as Ormund Hightower.\nDirectors for the third season include House of the Dragon familiars Clare Kilner, Andrij Parekh, and Loni Peristere, as well as Agents of S.H.I.E.L.D. and Supernatural veteran Nina Lopez-Corrado.\nHouse of the Dragon will continue its television adaptation of George R.R. Martin’s Fire and Bloodwhere Season 2 left off. That means Westeros remains on the brink of war despite a few revelations shared between Alicent and Rhaenyra in the last batch of episodes as peace becomes all the more unlikely. We gave Season 2 a 7/10 inour review.\nPrevious comments from showrunner Ryan Condal have revealed that House of the Dragon is planned to run forat least four seasons. For more on how the Game of Thrones show has fared thus far, you can read up on some changes to the source material thatMartin wasn’t in love with, as well asour closer look at whether or not the show has gone too far. You can also learn more about another upcoming Game of Thrones spinoff,A Knight of the Seven Kingdoms.\nMichael Cripe is a freelance contributor with IGN. He's best known for his work at sites like The Pitch, The Escapist, and OnlySP. Be sure to give him a follow on Bluesky (@mikecripe.bsky.social) and Twitter (@MikeCripe)."
  },
  {
    "title": "The New 2025 Samsung Neo QLED and OLED Smart TVs Are Now Available, Including 4K and 8K Models",
    "publishedAt": "2025-04-03T20:30:00Z",
    "url": "https://www.ign.com/articles/new-2025-samsung-neo-qled-and-oled-8k-and-4k-smart-tvs-are-now-available",
    "full_text": "Several of thenew 2025 Samsung TVsthat were showcased earlier this year atCESare now available for purchase at Samsung's official online store. Select Samsung Neo QLED and OLED TVs are currently in stock and they ship out immediately for as early as April 9-10 delivery. Alternatively, you can pick up select models at your local Best Buy. Not every TV has been released yet, but I expect more models to become available soon.\n\nSamsung showcased several of their top models duringCES 2025. Here's a quick rundown of the biggest highlights. At the moment, exact pricing for each model is unknown.\nSamsung revealed a total of six Mini-LED TV models for 2025, and three of the models are available for purchase starting today. The Neo QLED QN990F andQN900Fare true 8K TVs with some incremental improvements like the new anti-glare tech, the One Connect wireless transmitter box, and access to Samsung's Art Store, which was previously retricted to the Frame TVs. The Neo QLEDQN90F, QN85F,QN80Fand QN70F are the new 4K Mini-LED models. The highest end model is the QN90F and it will feature the same 165Hz refresh rate, Gen 3 processor, and anti-glare coating as the S95F. The mid-range QN85F will be Samsung's first 100\" TV.\nThe new OLED TVs - the S95F, S90F, and S85F - feature several incremental upgrades over its predecessors. The S95F, Samsung's flagship model, boasts a new NQ4 AI Gen 3 processor, a faster 165Hz refresh rate, an improved anti-glare coating, and an upgraded QD OLED panel that promises up to 2,000 nits of brightness. The S90F will also feature the Gen 3 processor, 144Hz refresh rate with VRR, and a QD OLED panel with up to 1,300nits of brightness (for TV models 55\" and up). TheS85Fremains the \"budget\" OLED TV with a Gen 2 processor and is the only model that's available now.\nNot yet released\nThe Frame Pro will make its debut this year alongside the standard Frame TV. The Frame Pro finally features the superior Neo QLED Mini-LED panel for richer and brighter colors, a faster 144Hz refresh rate, the new anti-glare tech, and wireless hookups in the form of a \"One Connect\" box that can be stowed away discreetly. The standard The Frame TV will still be available too, at a significantly lower cost I assume.\nSamsung QN90D (2024) Reviewby Jaron Schneider\nSamsung’s 2024 mini LED QN90D is a very nice television that refines the interface and adds a host of new features that increase the value of the offering. It’s expensive, but the brightness, color quality, wealth of HDMI 2.1 ports, built-in gaming, and more make a solid argument to warrant the asking price.\nLike just about everyone else in the industry, Samsung is going all in on AI. Samsung's new tech for 2025 is their \"Vision AI\", which can recognize the content you're watching, including specifics like the actors or setting, and display relevant personalized commentary in real-time. In addition, more TV models this year will be equipped with AI Upscaling Pro and AI Motion Enhancer Pro which work in tandem to optimize image quality on the fly. Other features include Active Voice Amplier Pro, which uses AI to isolate and enhance voices, AI Optimization, and AI Energy Mode.\nSamsung is also decisively moving many of their TV panels to the matte-like anti-glare coating we saw on the S95D in 2024. This anti-glare anti-reflective tech doesn't desaturate like we typically see with anti-glare coatings from other brands, and yet reflections are minimized to the point that you'll never notice them..\nIGN's deals team has a combined 30+ years of experience finding the best discounts in gaming, tech, and just about every other category. We don't try to trick our readers into buying things they don't need at prices that aren't worth buying something at. Our ultimate goal is to surface the best possible deals from brands we trust and our editorial team has personal experience with. You can check outour deals standards herefor more information on our process, or keep up with the latest deals we find onIGN's Deals account on Twitter.\nEric Song is the IGN commerce manager in charge of finding the best gaming and tech deals every day. When Eric isn't hunting for deals for other people at work, he's hunting for deals for himself during his free time."
  },
  {
    "title": "Avengers: Doomsday and Secret Wars 'A New Beginning' for the MCU, Russo Brothers Say",
    "publishedAt": "2025-03-17T17:01:57Z",
    "url": "https://www.ign.com/articles/joe-and-anthony-russo-say-avengers-5-and-6-will-be-new-beginning-for-mcu",
    "full_text": "The future of the MCU is starting to take shape. DirectorsAnthony and Joe Russohave teased howAvengers: DoomsdayandAvengers: Secret Warswill differ from their last two projects in the franchise, Avengers: Infinity War and Avengers: Endgame.\n\nDuring an interview with Brazilian outletOmelete, the directing brothers revealed that they see Avengers 5 and 6 as a “new beginning” that will lay the foundation for whatever comes next in Phase 7 of the MCU.\n\"The greatest thing that ever happened is we got to get immersed in a 20 movie arc and see an ending to that arc,\" Joe Russo said. \"What's compelling about these two new Avengers movies is they're a beginning. It's a new beginning. We told an ending story [with Avengers: Infinity War and Avengers: Endgame] and now we're going to tell a beginning story. Who knows where we’ll go from there?\"\nThe pair also opened up about how they ended up back in the Marvel world tackling another Avengers story. “We didn’t know what our road forward was in the MCU after we finished Endgame,” Anthony Russo explained.\n“What happened was, a creative idea just came to us and that ended up feeling like the right idea. It motivated us to do it again. We feel like we have something fresh, we feel like we have a story that’s important and needs to be told. We have an amazing group of collaborators again, some old and some new. We’re very excited.\"\nHe also noted that Doomsday is a “difficult” movie because of the “expectations on it” to help bring theatergoing back to its pre-pandemic glory. That said, the Russos also revealed it was Marvel producer Kevin Feige’s ideato bring Robert Downey Jr. back for Doomsday.\n“That conversation was had a while ago, and Robert tried to talk us into doing it and we said no,” Joe said. “We just didn’t have a story, we didn’t have a way in, so we were resistant for a while. And then one day, [Endgame writer] Steve McFeely called us and said, ‘I have an idea.’ ”\n“The only thing I’ll say about the movie is this: we love villains who think they’re the heroes of their own stories,” Joe Russo closed out the interview. “That’s when they become three-dimensional and they become more interesting. When you have an actor like Robert Downey, you have to create a three-dimensional, well shaped character for the audience. That’s where a lot of our focus is going.”\nAvengers: Doomsday is currently set to arrive in theaters May 1, 2026 and Secret Wars arrives about a year later in May 2027, so unfortunately, we’ve got a lot of waiting to do before we can see what the Russo brothers are cooking up.\nLate last year, Marvel Studios boss Kevin Feige teased the introduction of X-Men characters in the \"next few\" MCU movies.\nFeige told an audience at the Disney APAC Content Showcase in Singapore that fans would see “some X-Men players that you might recognize” in the next few MCU movies, but he stopped short of saying which characters or what movies.\nOn bringing the X-Men into the MCU, Feige added: “I think you will see that continues in our next few movies with some X-Men players that you might recognize.\n“Right after that, the whole story of Secret Wars really leads us into a new age of mutants and of the X-Men. Again, [it’s] one of those dreams come true. We finally have the X-Men back.”\nFeige has also said the X-Men will be an important part of the MCU’s future following Secret Wars. \"When we were preparing for Avengers: Endgame years ago, it was a question of getting to the grand finale of our narrative, and then we had to start all over again after that,” Feige said. “This time, on the road to Secret Wars, we already know very well what the story is going to be until then and afterwards. The X-Men are an important part of that future.”\nIt sounds like Phase 7 of the MCU will be dominated by the X-Men, then, but in the short term, Storm appeared inWhat If...? Season 3, marking the character’s first appearance in the wider MCU.\nIn October, Marvel Studios added three untitled movie projects to its 2028 release schedule: February 18, 2028; May 5, 2028; and November 10, 2028. It seems increasingly likely one of these movies is X-Men.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Friendship Review",
    "publishedAt": "2025-03-12T17:17:56Z",
    "url": "https://www.ign.com/articles/friendship-review-paul-rudd-tim-robinson",
    "full_text": "Friendship opens in theaters Friday, May 9. This review is based on a screening at the 2025 SXSW Film and Television Festival.\n\nTim Robinson’s character in Friendship is so perfect for his comedic persona, it’s incredible that he didn’t write it himself. It was writtenforhim, to be clear; director Andrew DeYoung said in an interview last fall that he sent the screenplay to Robinson with a note that said he wanted Robinson for the part, and that he planned to shoot it like a Paul Thomas Anderson movie. (More on that later.) Friendless, clueless, and prone to fits of frustrated rage, Craig Waterman is like a character from Robinson’s cringe-comedy series I Think You Should Leave, with about as much depth and equal capacity for laughs.\nCraig’s neighbor Austin is a perfect fit for Paul Rudd, too. Austin is a weatherman for a local news station, with a thick mustache, a glorious head of hair, a hot wife, and a successful local garage band. Austin has lots of friends, and likes to have them over for beers on a Friday night. Austin represents a certain type of quietly confident guy, the kind who collects vinyl and drinks craft brews and wears cool jeans that fit him just right. Craig, meanwhile, is neither confident nor quiet. He works for a company that specializes in making apps more addictive, is always holding an awkwardly oversized beverage, and buys all of his clothes from a company called Ocean View Dining.\nThe only person who can stand Craig is his wife Tami (Kate Mara) – and that comes and goes, frankly. He was the safe choice, a stable presence for Tami and their son Steven (Jack Dylan Grazer). Even so, Craig is inadequate as a provider: A running visual gag involves Tami trying to jam large floral arrangements into a tiny smart car, because Craig can’t afford to buy her a bigger one. He’s inadequate in a lot of ways, actually, and much of the humor in Friendship revolves around Craig’s metaphorical, feature-length cuckolding. His manhood is continually undercut by Tami, by Austin, by the guys at work, by Tami’s sexy firefighter ex, and even by Steven, who has two girlfriends and kisses his mom on the mouth.\nCraig reacts like a Tim Robinson character, which is to say that he takes it until he explodes in a fit of impotent rage. Robinson’s comedy is all about inappropriate reactions to ridiculous scenes: Think of the I Think You Should Leave sketch with Tim Heidecker as a condescending, gazpacho-craving boyfriend who populates a game of Celebrity with the un-guessable names of ancient jazz musicians. And that style manifests from Friendship’s opening moments, at a support-group meeting where Tami says that her cancer has been in remission for a year now (this is never mentioned again, by the way) but that there are certain things that still bother her, like wondering if she’ll ever have an orgasm again. Then it’s Craig’s turn to share. “I’m orgasming just fine,” he says.\nFrom there, we pivot to Craig’s burgeoning relationship with Austin, who’s new to the neighborhood and very generous towards the childlike idiot next door. They have a few “good hangs,” exploring the tunnels underneath their small town and foraging for wild mushrooms in the nearby woods. Then Craig humiliates himself at boys’ night, prompting Austin to politely tell him that he’s no longer interested in being bros. This happens a half-hour into this 100-minute movie, making its title somewhat misleading: Most of Friendship is about Craig’s freakout over being friend-dumped, rather than the friendship itself.\nA series of escalating absurdist scenarios follow, the funniest of which sees Craig lying on the floor in the stockroom of a cell phone store and licking a toad an 18-year-old named T-Boy (don’t ask) tells him will take him on a mind-bending psychedelic journey. You’ll have to watch the movie to find out where Craig’s mind's eye takes him, but it’s silly and unexpected and gives Robinson the opportunity to have one of his signature tantrums. The surrealist touches in DeYoung’s filmmaking are minimal, but he is fond of the evocative push-ins and Steadicam tracking shots favored by his professed inspiration Anderson, an elevated directing style that feels like a tongue-in-cheek bit in a comedy like Friendship.\nRudd basically disappears after the first act, and Mara literally disappears into the sewers for a few scenes. Robinson’s frequent collaborator (and fellow chronicler of brain-rotted 21st-century guys) Conner O’Malley shows up for a cameo, standing on a chair and ranting about how “we should still be in Afghanistan.” Robinson loses his phone in a puddle, smashes another one against a wall, and ruins several pairs of OVD khakis. His physical-comedy instincts are impeccable, even when the whole thing starts to feel repetitive after a while. (For comparison’s sake: Friendship runs about as long as a full season of I Think You Should Leave.)\nThe overall effect is of a series of interconnected comedy sketches on the loose themes of manhood and male bonding, which are hilarious if you vibe with Robinson’s style of humor and insufferable if you don’t. Friendship got big laughs at SXSW, leaving a handful of Robinson naysayers alienated and stone-faced in their theater seats. Sounds like the premise for a Tim Robinson sketch.\nPaul Rudd and Tim Robinson are both perfectly cast as neighbors – one cool and confident, the other a frustrated loser – in Friendship. The feature debut from director Andrew DeYoung is an absurdist take on the buddy comedy that plays like a loosely connected series of  sketches from Robinson’s Netflix hit I Think You Should Leave. That grows repetitive within a 100-minute timeframe, but DeYoung keeps things interesting with the kind of filmmaking flourishes you’d never see in a streaming sketch series."
  },
  {
    "title": "I Broke Up With The Walking Dead, But The Walking Dead: Dead City Might Bring Me Back",
    "publishedAt": "2025-03-22T14:15:00Z",
    "url": "https://www.ign.com/articles/i-broke-up-with-the-walking-dead-but-the-walking-dead-dead-city-might-bring-me-back",
    "full_text": "Streaming Wars is a weekly opinion columnby IGN’s Streaming Editor, Amelia Emberwing. Check out the last entryDaredevil: Born Again — An Unexpected Connection to the Netflix Series Could Right a Decade-Old Wrong.\n\nThis column contains spoilers for The Walking Dead franchise.\nWhen people bring up The Walking Dead, I always cheerfully change the subject with a simple “I broke up with that show.” It’s dramatic, it’s definitive, and the cheery way I deliver the sentiment is, I suppose, somewhat unnerving. If people pry further, I explain that I loved it, it broke my heart too many times — I will never stop being mad about the pointless death of Beth Greene (Emily Kinney) — and then I left.\nSee? Breakup. A blissful one that I have never had second thoughts over until The Walking Dead: Dead City. But let’s not get ahead of ourselves.\nThere was a time, early on, when almost every dang moment in The Walking Dead was engaging. We were engrossed! The whole world (the whole world that had AMC or applicable streaming services, that is) would tune in every Sunday to find out what was going to happen to the crew. We even tolerated the show treating “we [humans] are the walking dead” as some kind of revelation! It was addictive, right up until it wasn’t. I can go on and on about how shows like The Walking Dead require hope to be interesting, and killing off your only two hopeful characters (Beth and Chad L. Coleman’s Tyrese) back to back with Negan on the horizon (and then somehow makingthatsituation even more bleak) and expecting people to remain engaged is a fundamental writing failure, but that’s not the point here. The point is that I have been blissfully separated from this franchise for adecade,but there is something about the Negan (Jeffrey Dean Morgan) and Maggie (Lauren Cohen) spinoff The Walking Dead: Dead City that I find absolutelyfascinating.\nThe trailer for Season 2 of the spinoff dropped this week, pulling the series from the “out of sight, out of mind” section of my brain and reminding me, yet again, to look at this crazy-ass series. Something about the show’s absurd premise of putting a widow on a quest with the man who brutally murdered her husband in cold blood right in front of her is intriguing in a way that grabs my attention every time it comes up.What do you mean Negan and Maggie are working together?\nIt’s a premise so insane that it manages to outweigh the question of “how the hell does Daryl (Norman Reedus) get to France in the middle of the apocalypse?!” I don’t actually care enough about how Daryl made it to France, or how Carol (Melissa McBride) somehow followed separately, to find out. But I do, for some unfathomable reason, find myself engaged by the idea of Maggie and Negan being forced into what is, perhaps, the strangest team-up in television history. A thought that I have after watching 15 seasons of Morgan’s former series, Supernatural, and witnessing those idiot boys team up with nearly every villain they encounter at one point or another. You’d think that would prepare me for any “working with your mortal enemy situation,” and yet…\nBeyond all of that, there’s a scene in The Walking Dead: Dead City’s Season 2 trailer that shows Maggie wielding Lucille, Negan’s treasured bat that was used to brain her beloved husband Glenn Rhee (Steven Yeun). That frame alone is enough to ticklemybrain in a way that I start to wonder “what if I gave this spinoff a chance?” before I snap back to reality and remember that way lays endless frustration.\nEven still, I have to praise the writers without seeing a single episode of the spinoff. Ideas may be cheap, but engaging an audience up front is not easy, and sparking the curiosity of someone who broke up with your franchise and never looked back is even harder. They have created a premise that intrigues in a way that The Walking Dead has been unable to accomplish in years. So much so that there may come a day where, in a moment of weakness, I hit play on that first episode and give Maggie and Negan’s absurd (platonic) pairing a chance to wow me beyond my initial “damn, that’s interesting.”\nOver the years The Walking Dead has remained alivethanks to international views, which has me curious: if you’re in the U.S., have you been watching The Walking Dead: Dead City or any of the show’s other spinoffs? And for the international folks that have remained loyal to the franchise, what keeps you engaged after all these years?"
  },
  {
    "title": "The Internet Has Thoughts on Who Sadie Sink Should Play in Tom Holland's Spider-Man 4",
    "publishedAt": "2025-03-14T16:41:33Z",
    "url": "https://www.ign.com/articles/the-internet-has-thoughts-on-who-sadie-sink-should-play-in-tom-hollands-spider-man-4",
    "full_text": "So, you might’ve heard this little tidbit of news lately:Stranger ThingsstarSadie Sink is officially joining the Marvel Cinematic Universe in the next Spider-Man. But now comes the speculation: who, exactly, will she play in Spider-Man 4?\n\nYou’ve got theories, I’ve got theories, and we’re not alone — the whole internet’s got theories. Needless to say, fans' minds are racing. So what do they think? Well, let’s go over the most distinct possibilities (and, for that matter, impossibilities).\nIt seems as though most folks find the idea of Sink ending up being the, quote unquote, real Mary Jane Watson due to her red hair to be a bit silly. “Michelle Jones isthe MCU’s real MJ,” one fan wrote on Reddit — and most fans in the thread agreed. Though another Redditor noted the studio might cast Sink in the role as a “bold attempt to win back those who prefer classic Spider-Man.” The obvious choice is not always the best one, folks.\nZendayahas played the MCU’s new MJ since 2017’s Spider-Man Homecoming, and despite not being the standard red-haired Mary Jane fans know from the comics andSam Raimi’s previous trilogy, modern day Spidey lovers have generally accepted her as their MJ. So it seems as though they’ll keep her around, especially considering she is said to be, at minimum, coming back for a cameo for this yet untitled sequel toNo Way Home.\nSome fans think Sink may end up playing one of Peter Parker’s other love interests, Gwen Stacey. After all, wigsdoexist. “Much to the surprise(and potentially dismay) of everyone,” one user said about Sink in the role previously played by Emma Stone in Marc Webb’s The Amazing Spider-Man duo. “I absolutely would not want to see [that] sincewe’ve already gotten a Gwen Stacy/Peter Parker love storyand I definitely have no interest in seeing Spider-Gwen right now,” another Redditor added.\nSpider-Gwen is a distinct part of the animated Spider-Verse, where she is voiced by Hailee Steinfeld, so it seems like fans prefer to follow her story there for the time being. Consideringhow major the Peter and Gwen love story wasin Webb’s Spider-Man films — itdidgive way to a lengthy real-life relationship between Stone and Andrew Garfield, who played Parker/Spider-Man — it makes sense that fans wouldn’t really want to see that rehashed. There’s a ton of Spidey territory to cover between his many comic adventures and appearances, so giving Sink something different to do is most likely the key to making her inclusion a success.\nAnother theory folks have been throwing around is the idea that Sink might end up playing another famous MCU redhead: X-Men’s Jean Grey, also known as the Phoenix. She was played as an adult by Famke Janssen in five films in Fox’s X-Men franchise. Later, she was portrayed as a teenager by Sophie Turner in2019’s Dark Phoenix.\nOne user on Reddit considered that idea “too obvious,” while another agreed and added: “Weird to intro [her] in SM4.” That said, a third fan noted that there could always be more castings in the future that could lead tomore mutants joining the fold for Spider-Man 4. Others have doubts about a mutant showing up with true relevance in a Spider-Man focused film. “I just don't seeone of the core X-Men getting introduced in a Spider-Man movie,” a fan wrote.\nBut it seems as though the most popular guess — and potentially the best guess as well — is a lesser known character called Firestar, a redhead mutant named Angelica Jones who is a mainstay in the X-Men, as well as the 1981 animated seriesSpider-Man and His Amazing Friendswhere she debuted. She could definitely be that “something different” I was talking about — and lots of fans seem excited about the prospect of bringing her into the story as it stands within the MCU.\nIndeed, fans seem particularly excited at the idea of bringing those Amazing Friends back together. “She'll be a college student alongside Peter and their friend/partner Bobby Drake. They'll all live in the same apartment too,” one user commented. “This will bethe adaptation of Spider-Man and His Amazing Friends we've all been waiting for, lol.” Another agreed, “I would lovea Spider-Man and His Amazing Friends team-up!” while a third added: “If they did the Amazing Friends lineup,people would lose their minds.”\nFirestar started as a Spider-Man character, but eventually broke off and expanded into her own story that included alliances with the New Mutants, Hellions, and the Avengers themselves. So considering her origins, it might just be the perfect character to introduce. However, one fandidmention, “If Firestar, why not Jean?” and to be fair, they have a point. But right now, it’s anyone’s guess who Sink will end up making her MCU debut as. Only time will tell.\nPhoto by Arturo Holmes/WireImage.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Severance Full Season 2 Review",
    "publishedAt": "2025-03-21T11:25:28Z",
    "url": "https://www.ign.com/articles/severance-full-season-2-review-apple-adam-scott-britt-lower-john-turturro-zach-cherry",
    "full_text": "This review contains major spoilers for Severance season 2.\n\nSeason 2 of AppleTV+’sSeverancegot off to a bit of a slow start, as it expanded its scope to give more depth to the Macrodata Refinement team and their employers at Lumon Industries. But the back half of the season picks up speed and returns the surreal science-fiction series to its former, compelling self, finally delivering some answers to its core mysteries. Creator and showrunner Dan Erickson’s twisty plot and multi-personality premise allows the cast to truly show their range, while the talent behind the camera – headlined by director Ben Stiller and cinematographer Jessica Lee Gagné – set the bleak tone with their stark footage of empty offices and desolate frozen landscapes.\nThis season focuses on the conflict between each character’s Innie and Outie self, jumping off from the first season’s brutal battle of wills between the two sides of Britt Lower’s character: Lumon scion Helena Eagan and her counterpart on the severed floor, Helly R. Watching them seek to understand who they truly are – while the Innies weigh their desire to exist against the potential to make things better for themselves and their colleagues – is fascinating.\nHelena seizes on Helly’s budding romance with Innie Mark (Adam Scott) to further manipulate Lumon’s most important severed worker while also flirting with his Outie. (It’s as if she’s trying to understand what made a part of her fall in love with him.) Scott has done a phenomenal job throughout the series showcasing the difference between Innie Mark, who typically tries to put on a brave and friendly face to keep his coworkers motivated, and his depressed and sardonic Outie. This season beautifully brings both personas together in pursuit of rescuing Mark’s wife, Gemma (Dichen Lachman), only to tear them apart in episode 9, “The After Hours.” It’s a stunning performance by Scott, as his smugness and earnestness clash when it becomes clear that Mark is just as dismissive of his Innie’s personhood as Helena.\nDylan George (Zach Cherry) earns most improved character honors this season, thanks to a new Lumon perk designed to distance him from his Innie colleagues: the chance to spend time with his wife, Gretchen (Merritt Wever), while he’s still at work. The difference between the brooding, distracted Outie Dylan and his Innie’s delighted awe at getting to know Gretchen is heartbreaking, but the reconciliation between both versions of Dylan makes his arc triumphant. It also creates an example from which the other severed employees might learn to accept themselves.\nRomance also factored into one ofseason 1’s highlights, with MDR stickler Irving Bailiff (John Turturro) abandoning his focus on office protocol in pursuit of romance with fellow severed employee Burt Goodman (Christopher Walken). Turturro burns even brighter in season 2: Irving immediately suspects Helly is lying about her time in the outside world and relentlessly pursues that theory, a doggedness that culminates in one of the best scenes of the season. The sacrifice he makes in the moment is stirring; it’s a real testament to the writing on Severance that this moment also contains a clue that pays off in the following episode. The beautifully tragic second act of the Irving-Burt arc that follows allows Walken to show a bit of his signature menace, but his character ultimately redeems himself when he gives the fired Irving an escape from Lumon’s grasp. I hope this isn’t the last we see of Irving; as severed floor manager Seth Milchick (Tramell Tillman) Milchick tells Mark earlier in the season, “I’d hate to reward his courage with nonexistence.”\nSeason 2 goes deeper on the innies’ supervisors, too, to mixed results. Too much time is spent in the early episodes watching Harmony Cobel (Patricia Arquette) drive around as she figures out what to do with her post-Lumon life. This feels especially unnecessary following an eighth episode focused on Harmony’s loyalty to the company and everything it took from her – those 37 minutes provide enough explanation of why she would finally decide to help Mark. The Cobel scenes have a less-is-more inverse in the way season 2 illuminates previously unseen facets of Milchick and his struggle to cling to power within an organization that seeks to diminish and belittle him. Arquette is great at vague, menacing sternness, but it feels like there’s more to explore with Tillman’s character as he navigates the absurdity of his job, like when he forces a child to sacrifice her toy just before rushing off to lead a celebratory marching band.\nOne of the best looking series on television grows even more so in these episodes, tightly linking the style and substance of its dark science fiction. Stiller continues to show he’s a master at creating a palpable sense of isolation and despair in the surreal frozen journey of “Woe’s Hollow” and the desolate company town of “Sweet Vitriol.” But the most perfect crystallization of the show’s aesthetic and tone might be the loop created by Mark’s panicked sprint through the empty halls of the severed floor in the season 2 opening – bookended by the joyous run he takes with Helly at the end of the finale.\nAfter doing so much to shape the visuals of Severance in season 1, cinematographer Jessica Lee Gagné confidently takes the director’s chair for the seventh episode of season 2, “Chikhai Bardo.” The jarring transitions between scenes and themes of love, loss, and memory-tampering recallEternal Sunshine of the Spotless MindandDollhouse, but this is an emotional devastation that Severance can call its own. It’s bolstered by Lachman (speaking of Dollhouse), who demonstrates the kind of passion and wit that would make someone’s former husband want to forget her for eight hours a day. With their positions effectively switching, I’m looking forward to seeing if Gemma will find a way to actually reunite with Mark next season, or if Helly might fulfill her father’s vision and rule the severed floor rather than freeing the people who work there.\nCheck out ourSeverance season 2 ending explainedfor a rundown of how it wrapped up and where it might go next in season 3.\nThough it takes a few episodes to get going, season 2 of Severance eventually helps secure the Apple series’ status as top-tier science fiction TV. These 10 episodes deliver scathing commentary on corporate culture through a surreal, twisty, and deeply emotional story. Time spent developing the supporting cast gives extra resonance to their decisions and behavior in both the Lumon office and the outside world while allowing the cast to show off its range. It’s also one of the most stylish TV shows out there, ending season 2 with a particularly satisfying finale that promises an entirely new normal for season 3."
  },
  {
    "title": "Side Quest Review",
    "publishedAt": "2025-03-26T07:00:00Z",
    "url": "https://www.ign.com/articles/side-quest-review-apple-tv-plus-mythic-quest",
    "full_text": "Side Quest is now streaming on Apple TV+.\n\nOver the course of four seasons (the most recent of which just ended),Mythic Questhas built a fully realized, ripe-for-exploration universe around the sturdy core of a classic workplace sitcom. This is part of the reason why it’s one of the best, most reliable TV comedies of the streaming era – it doesn’t hurt that the Apple TV+ series set in the world of video-game development is also extremely funny. Hot on the heels of its fourth-season finale comes Side Quest, an entertaining anthology series that delves further into the lives of the people who make, play, and love Mythic Quest’s namesake MMORPG. The parent series has wandered down these kinds of one-off detours several times, and almost always found a worthwhile destination – most notably the first-season highlight “A Dark Quiet Death.” Yet, at a mere four episodes, Side Quest’s expansion pack feels like it ends just as it gets going.\nLet’s get this out of the way: Nothing in Side Quest surpasses or even comes close to “A Dark Quiet Death”’s level of quality. It’s never as substantial as that exceptional piece of television, but the spinoff is still a good elaboration on Mythic Quest’s themes of community and boundaries. And while it’s not like Side Quest contains overly complicated links to previous episodes or puzzles to solve, some details will get lost in translation if it’s your first encounter with the fantastical realms maintained by Ian Grimm, Poppy Li, and company.\nOf the four episodes, the first, “Song and Dance,” has the strongest ties to the Mythic Quest office: It follows beleaguered art director Phil (Derek Waters) in his continually thwarted attempts to disconnect for a few days. Having appeared in six episodes across seasons 2 and 3, Phil is enough of a fixture that viewers will immediately recognize his downtrodden aura – Ian (Rob McElhenney) has a history of throwing last-minute assignments at him and expecting immediate results. Ian doesn’t respect anyone else’s free time, and as we see in “Song and Dance,” that carries over to Phil’s luxury vacation with his girlfriend Maude, played byPen15’s Anna Konkle.\nThirty minutes of Phil having his time off disrupted by calls from Ian would get stale quickly, so I’m grateful that “Song and Dance” is more about digging deeper into his personal life and psyche. This enriches the Mythic Quest universe: All we know about Phil prior to “Song and Dance” is how put-upon he is, but there’s no interior life in a running gag. We’ve seen Ian cross work-life boundaries before; it might seem like there isn’t any new ground to cover here. But Phil’s low self-esteem adds an extra dimension to the dilemma. Konkle contributes significantly to that feeling, too, hitting notes that are equal parts frustrated and loving – never too smothering, and never too cold, either.\nThe remaining three episodes distance themselves from Ian and the MQ regulars, which lends some additional novelty to the proceedings. Whereas Mythic Quest has boasted some big-name guest stars in the past – Anthony Hopkins, William Hurt, and Joe Manganiello, to just name a few – Side Quest avoids stunt casting, which suits the types of stories it’s telling. Not to say that this is a cast of fresh faces and newcomers, but there also isn’t anyone whose established star power or fame pulls focus or feels like an odd fit in such humble surroundings.\nThis also feels in line with the ways Side Quest explores how we form community through art. Games are only one piece of the picture: The second episode, “Pull List,” takes place in a comic-book store. This blind-box stacking, Magic: The Gathering card-slinging spiritual cousin to High Fidelity (the John Cusackmovieandthe Zoë Kravitz Hulu show) is my favorite of the four episodes, but part of me thinks that picking a favorite is a Rorschach Test for your relationship to Mythic Quest. In this case, it underlines how much the ensemble-focused episodes like season 4’s murder mystery, “The Villain’s Feast,” tend to stand out and resonate. (Besides: The more I sit with it, the more my Side Quest ranking changes.)\nAs the staff and clientele of Comics Galore! trade punchy dialogue about whether Superman or Goku would win in a fight and what characters they claim as Black (Elmo: yes, Big Bird: no), Mythic Quest lore blends deeper our pop-culture world. Written by Leann Bowen and Javier Scott, “Pull List” digs into what makes someone a fan, the pissing matches that sometimes result from trying to prove that fandom, and the growing tension between multiple characters coveting the store’s lone copy of the latest Mythic Quest tie-in comic. It also sets itself apart from the rest of the anthology visually, with playful graphics that pull comic–book imagery into the real world.\nEach episode has its own distinct visual identity, but the overall look is still unmistakably Mythic Quest. That’s especially true of the season finale, “The Last Raid,” a screenlife story à laUnfriendedorSearchingdepicting a milestone raid for a long-running guild. In-game graphics punctuate regular Mythic Quest episodes, and here they take center stage as one group of online friends face their greatest test: the way their IRL relationships are developing (or faltering). It’d make a great double feature with the recently released, staging-a-Shakespearean-tragedy-in-GTA-Online documentaryGrand Theft Hamlet: Another sympathetic, nonjudgmental (but still funny) depiction of how video games can be a lifeline for the socially isolated.\nSide Quest’s ability to explore so much new terrain through the lens of a single, fictional video game is why I wish it were longer. And while the scope may be there, and all four episodes are engaging and thought-provoking, they ultimately lack the oomph of “A Dark Quiet Death” or its second-season counterpart, “Backstory!” It falls plainly on one end of the Goldilocks principle that plagues many streaming series: Not enough episodes to satisfy our hunger for more Mythic Quest; too slight to stick with you after the credits roll. This is no more apparent than in the third episode, which imparts its message early on but lacks a punch to carry it home. Its story of a cellist learning to separate her passion and her profession (with help from the Mythic Quest score) is sweet, but not much else. Still, it’s a credit to the creative team and performers that I became emotionally invested in all of these characters' lives within the span of 30 minutes. If only there were a few more chances to do so.\nIt’s no surprise that a Mythic Quest spinoff would be a funny and often heartfelt exploration of community. The four episodes of Side Quest all take on different elements of the MQ universe, tapping into struggles with work-life balance and how a job can consume your life. The first episode eases us with a familiar character, but the three that follow aren’t afraid to delve into new settings populated by unfamiliar faces. It’s an enjoyable and ambitious supplement to one of today’s best streaming comedies – but at only four episodes, Side Quest feels too slight, and unable to reach the high bar set by previous Mythic Quest one-offs."
  },
  {
    "title": "Avengers Director Joe Russo Says AI Was Used for Voice Modulation in Netflix Film The Electric State, Insists 'AI Is Best Suited Towards Creativity'",
    "publishedAt": "2025-03-17T14:28:23Z",
    "url": "https://www.ign.com/articles/avengers-director-joe-russo-says-ai-was-used-for-voice-modulation-in-netflix-film-the-electric-state-insists-ai-is-best-suited-towards-creativity",
    "full_text": "There’s no denying the Russo Brothers’ new Netflix filmThe Electric Statehas been the talk of the town since it debuted on Friday — and with the industry’s climate the way it is, fans have certainly been discussing itsuse of AI.\n\nThat said, Joe Russo, who alongside his brother Anthony directed Avengers: Infinity War and Avengers: Endgame, has defended the use of AI for voice modulation in The Electric State, claiming it was “something any 10-year-old could do after watching a TikTok video.”\n\"There’s a lot of finger-pointing and hyperbole because people are afraid,” Joe Russo insisted in an interview withThe Times. “They don’t understand. But ultimately you’ll see AI used more significantly.\"\nThe filmmaker added that he sees potential in the technology. \"Also, AI is in its generative state now, where it has, as we call them, hallucinations. You can’t do mission-critical work with something that hallucinates,” Russo said. “That is a reason self-driving cars haven’t taken over, or why AI surgery is not taking place worldwide. But in its generative state, AI is best suited towards creativity.\"\nWhile many artists across a whole host of disciplines feel AI is actually the antithesis of creativity, it seems as though some of the studios are excited to use the tech when it’s ready to be implemented. Back in July 2024, Netflix CEO Ted Sarandos claimed thataudiences “don’t care” if AI is used in the film and television programming they watch. Sarandos doubled down and asserted that the tech is \"a great way for creators to tell better stories.\"\n\"Animation didn't get cheaper, it got better in the move from hand-drawn to CG animation, and more people work in animation today than ever in history,\" Sarandos said on the call. \"So I'm pretty sure there's a better business and a bigger business in making content 10% better than there is in making it 50% cheaper.\"\nFor what it’s worth, not everyone seems to be embracing AI right off the bat. Last month,Marvel denied using AIto create teaser posters for the upcomingThe Fantastic Four: First Steps, despite one of the people in the imagery sporting a four-fingered hand.\nThe Electric State was directed and produced by Anthony and Joe Russo from a script by Stephen McFeely and Christopher Markus, which was loosely adapted from a 2018 illustrated novel by Simon Stalenhag. The movie stars Millie Bobby Brown, Chris Pratt, Ke Huy Quan, Woody Harrelson, Jason Alexander, Anthony Mackie, Jenny Slate, Giancarlo Esposito, Brian Cox, and Stanley Tucci.\nIGN'sThe Electric State reviewreturned a 4/10. We said: \"Marvel’s biggest hitmakers join forces again with the Netflix algorithm to deliver The Electric State, a $300-million anti-event movie.\"\nThe Russo Brothers are down to direct the next two Avengers movies for Marvel Studios: 2026's Avengers: Doomsday and 2027's Avengers: Secret Wars.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "The Studio's 'The Oner' Tops a Crazy Month of One Shot Takes, Joining Daredevil: Born Again and Adolescence",
    "publishedAt": "2025-03-26T17:36:04Z",
    "url": "https://www.ign.com/articles/the-studios-the-oner-tops-a-crazy-month-of-one-shot-takes-joining-daredevil-born-again-and-adolescence",
    "full_text": "This article contains spoilers forThe Studio, and allusion to key plot points inAdolescence, andDaredevil: Born Again.\n\nWhen a one-shot take begins, unless it’s been part of the marketing campaign for the TV show or movie, you likely don’t know it’s happening. But as that scene unfolds without the use of cuts, it turns into a dizzying magic trick, one that often helps elevate the piece of entertainment you’re consuming to a higher level based on the mere impressiveness of the technique involved. Disney+’s Daredevil: Born Again employed the one-shot with some digital trickery for its premiere fight scene. A week later, Adolescence wowed critics and dominated Netflix’s Top 10 with four intense episodes composed entirely of one shot each. And now, thanks to Apple TV+’s The Studio, we’ve got a hat trick, the perfect capper to this trilogy of March TV one-shots with an episode titled “The Oner” that completely obliterates the wonder of the one-shot take, while miraculously providing a wondrous – and hilarious – 26-ish minute long take itself.\nWritten and directed by Seth Rogen and Evan Goldberg, the second episode of the two-part premiere of The Studio follows new movie studio boss Matt Remick (also Rogen) and his best friend and VP Sal Saperstein (Ike Barinholtz) as they visit the set of a new Sarah Polley movie, The Silver Lake, starring Greta Lee. Remick is giddy because Polley is filming a “oner,” aka a one-take shot, and as a cinema fan first and film exec second, he wants to be present for possible film history. Unfortunately, nobody else wants him to be there because having the studio boss – particularly one who is a disruptive, nervous wreck like Remick – on set will potentially play havoc with the delicate and time-sensitive nature of filming the shot.\nGuess what happens? The episode is spiraling levels of hilarious tension, a perfect storm of brilliantly elevated comedy from expert performers like Rogen and Barinholtz, alongside Catherine O’Hara, Polly, and Lee that starts as a comedy of manners and ends with Remick completely obliterating the set of the movie, Three Stooges style. And that would be fun enough. But thanks to the movie-obsessed Remick, we also get an analysis of what makes one-shot takes work – and not work – as the show itself plays with the form.\nThat’s the essential trick of the one-shot take, that more often they’re notactuallyone shot. It’s ridiculously difficult to make a scene in a movie or TV show work perfectly even if you’re aiming for a singular shot of one person with a camera locked off on a tripod, let alone hundreds of extras, a moving Steadicam, or any sort of stunts. There are multiple techniques often employed to mask multiple shots to make them look like one shot, to allow more than one take in a “one-take” scene.\nThough there are multiple examples of oners throughout history, the most famous example – and arguably the movie that made them famous – is Alfred Hitchcock’s 1948 thriller, Rope. The conceit of the film is that it happens in “real-time,” which is also not true – it’s supposed to take place over 80 minutes when it’s actually 100 minutes long. But Hitchcock shot the film to look like it was one, continuous take when in fact each take is between four and a half to 10 minutes long.\nPart of the reason for this, beyond allowing for resetting of scenes, is that Hitchcock was restrained by two issues, both relating to film stock: one, he could only shoot up to 10 minutes at a time on film; and two, the projectionist needed to change reels every 20 minutes. The way Hitchcock accomplished this was by panning past objects, or having objects or people pass by his camera in a consistent manner. Having the camera briefly capture a man’s black jacket, for example, helps mask the cut between one shot and the next because the screen becomes black; and the “space” between one frame of film and another is also black, so the audience won’t notice the cut happening.\nLater productions have stretched this further. 1982’s Macbeth filmed a 57-minute long, continuous take. Andy Warhol’s 1964 art film Empire was 485 minutes long, though that did mask the cuts.\nAnd with the advent of the digital age, while we won’t say this has become easier, there are definitely more options. CGI has allowed filmmakers to digitally stitch together shots in a way that hopefully makes them look like one, continuous take. And digital itself has whisked away the issues Hitchcock had, with a shot given the potential to be as long as your hard drive has room for. 2023’s Paint Drying, an experimental film created as a protest to force the British Board of Film Classification to watch the filmmaker’s entire movie, is over 10 hours long.\nGiven that TV has a long history of live broadcasts, which ostensibly could make a oner relatively easier to achieve, it’s surprising that we haven’t seen more one-shot takes on the small screen; though perhaps the needs of advertising have prevented that, as they’re required to cut to commercials with regularity. But as TV budgets have grown, and streaming has taken over, more film techniques like the one-take shot have moved from cinemas to television. The first season of True Detective employed a six-minute-long tracking shot that wowed critics and fans of the HBO show in 2014. A year later, Netflix’s Daredevil was lauded for a jaw-dropping three-minute-long fight scene the show would top every season… Leading to a masterpiece just under 11-minute one-take scene set in a prison riot in Season 3 of the Marvel series. HBO took back the crown, though, in 2023 for a 27-minute take in a key episode of Succession where Logan Roy’s (Brian Cox) children reacted to his sudden death.\nThere are plenty of other examples, from an episode of Netflix’s The Haunting of Hill House that uses five seemingly continuous takes to tell the story of Hill House over two time periods, to an episode of It’s Always Sunny In Philadelphia that shows Charlie Day absolutely losing it over seven harrowing (and hilarious) minutes. Point being, the one-take shot has become part of the language of TV in more recent years in a way that it wasn’t for most of its early history.\nWhich brings us back to March of 2025, TV’s Month Of Oners. It also raises the question of why we’ve gotten so many one-shot takes over such a short period. The simple answer is that they’re there for different reasons, so in some respects, it’s a coincidence. The more complicated answer is that TV has become so packed with TV shows, that anything buzzy like a one-take shot will hopefully make a series stand out from the pack.\nFor Daredevil: Born Again, they had done a one-take shot in every previous season of the series. And with the opening episode continuing – and somewhat ending – that story with the initial return of characters Karen Page (Deborah Ann Woll) and Foggy Nelson (Elden Henson), it makes sense to havea visual call-outto those stand-out hallway fights from the previous three seasons and put them to rest alongside the law firm of Nelson, Murdock, and Page. While the scene is marred by more obvious digital stitching, it follows Daredevil (Charlie Cox) as he battles Bullseye (Wilson Bethel) through the bar Josie's, into a back room, up a stairway, and onto the roof -- before ending, punctuated by tragedy.\nAdolescence’s stunning one-take shots serve a different purpose, beyond being technically impressive. Each hour-long episode is shot in one take without the use of CGI or the panning cuts pioneered by Hitchcock. Instead, the filmmakersfilmed each episode10-13 times, with multiple rehearsals for both actors and the crew. The result is you, the audience, are following the case of Jamie Miller (Owen Cooper), a 13-year-old accused of murdering a classmate, in real-time. The show itself is less concerned with the act thanwhyJamie did it, and how it ties into a culture of toxic masculinity that impacts young boys. By using one take, the show certainly embraces a “voyeuristic element,” but ultimately is about putting you in the same place as the Miller family as they piece together what Jamie did – and the fallout from his actions.\nFor The Studio, “The Oner” throws all of these techniques in a blender. It not only uses the one-take shot to amp up the comedic tension of the episode, as with the dramatic tension of Daredevil: Born Again, and puts us in the voyeuristic god-seat screaming at Remick to not do what we know he’s going to do, similar to moments in Adolescence. But The Studio episode also works as a de facto teaching tool about one-shot takes, and why they do and don’t work. It’s essentially Rogen and Goldberg doing a victory lap, almost quite literally: the episode begins with Remick and Saperstein driving in the former’s car to set and ends with them leaving the set, creating a visual loop, aka a bookend, something Remick notes he loves midway through the episode.\nIn the middle, we get brilliant bits like Remick wearing a suit to set, and then changing into an extra’s wardrobe so he can fit in with the more casual vibe, then getting mistaken for an extra later on – ruining the shot. They talk about using whip pans to mask a cut, something Polley says she doesn’t want to do, right as they use a whip pan to mask a cut. And Polley allows Remick on set merely because she desperately wants to include a Rolling Stones song in her movie, which will cost an additional $800,000. Not only does the episode end with them not getting the oner because of Remick’s accidental interventions, but what plays over the end credits? The Rolling Stones “You Can’t Always Get What You Want.”\nThe whole idea of the one-take shot is summed up early in The Studio episode, thanks to a conversation between the crasser Saperstein, and the more idealistic Remick.\n“Oners are just so stupid,” Saperstein says. “It’s just the director jacking off while making everyone else’s lives miserable. Audiences do not care about this shit.”\n“Are you kidding me?” Remick answers. “The oner is the ultimate cinematic achievement, you know? It’s like the perfect marriage of artistry and technicality… It’s also like a great storytelling tool, you know? You see Greta Lee’s character go from being confident to broken all in one take with no cuts? That’s perfect, you know?”\nBeyond Remick saying “you know” a lot, that sums it up nicely. Saperstein isn’t necessarily wrong, that the prohibitively difficult one-take is a director showing off, as Rogen and Goldberg are doing here. But Remick is also correct that when done right, it is a combination of art and technique that can be used to elevate the storytelling of the episode. When Remick refers to Lee here, he’s of course presaging his own journey from confident studio head to a bloody mess fleeing set in disgrace at the end of the half-hour.\nAnd yes, The Studio episode skewers the pretensions of a one-take shot, as the oner inside the oner doesn’t seem entirely necessary for the movie they’re making. But it also, like every episode of the series, celebrates film-making in all its forms. Rather than the hat trick of one-take shots this month serving as a skewering death knell for the technique, it’s a loving look at why they work. It’s impressive, for sure, from a fight scene in Daredevil: Born Again, to dramatic scenes in Adolescence, to comedic ones in The Studio. But beyond that, it pushes an already difficult task – making a TV show – to its absolute limits, and shows what a small village of people can create if they put their minds to it.\nThe oner is a magic trick. But it’s also the rare case where knowing how the trick is done – like how we’re shown the gears falling out of the machine on The Studio – it becomes all the more impressive. And at its best, elevates the material. Remick may have ruined the final shot of The Silver Lake, but in the process, Rogen and Goldberg helped make TV history."
  },
  {
    "title": "From Zombies to Wizards: Shaun of the Dead Star Nick Frost Might Just Be Our Next Hagrid in HBO Harry Potter Series",
    "publishedAt": "2025-03-26T13:54:34Z",
    "url": "https://www.ign.com/articles/from-zombies-to-wizards-shaun-of-the-dead-star-nick-frost-might-just-be-our-next-hagrid-in-hbo-harry-potter-series",
    "full_text": "The new Wizarding World is starting to take shape. Casting is currently underway forHBO’s upcoming Harry Potter TV series, and while only a few roles have folks attached, it looks like Potter’s trusty sidekick and Hogwarts groundskeeper Rubeus Hagrid is one of them.Shaun of the Deadstar Nick Frost is reportedly currently in talks to take on the role.\n\nThat said, HBO released a fairly generic statement noting that it won’t comment on casting decisions unless they’re confirmed. “We appreciate that such a high-profile series will draw a lot of rumor and speculation,”the network explained via Variety.  “As we make our way through pre-production, we will only confirm details as we finalize deals.”\nSo far, there is only one confirmed role cast for the HBO series:John Lithgow confirmedthat he would be taking on the part of Albus Dumbledore, headmaster of Hogwarts. With Lithgow officially in the mix, fans now have to wait and see if the other rumored casting talks pull through.\nBlack Mirror starPaapa Essiedu is currently in talksto star as Severus Snape, Hogwarts’ devious potions professor, with Janet McTeer also in talks to join the cast as Minerva McGonagall, the transfiguration professor and head of Gryffindor house. However, unlike Lithgow, Essiedu, McTeer,andFrost have not yet been confirmed — so there’s certainly still waiting to do as the cast continues to grow.\nHagrid was originally played by thelate Scottish actor Robbie Coltrane, who appeared in all eight films.\nThis week,The White LotusSeason 3 star Jason Isaacs suggesteda surprising pick for who should take over his role as Lucius Malfoy.\nPhoto by Joe Maher/Getty Images.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Morpheus Actor Laurence Fishburne Reveals He Was Turned Down for The Matrix Resurrections — So He Might Not Be Back for Matrix 5 Either",
    "publishedAt": "2025-04-04T16:42:01Z",
    "url": "https://www.ign.com/articles/morpheus-actor-laurence-fishburne-reveals-he-was-turned-down-for-the-matrix-resurrections-so-he-might-not-be-back-for-matrix-5-either",
    "full_text": "If there’s one actor we’d like to see return forthe Matrix 5, it’s Laurence Fishburne. But unfortunately, it seems as though that might not be in the cards for the legendary actor. He recently revealed that he made himself available for the fourth film,The Matrix Resurrections, but was turned down to reprise his role as Morpheus — so being in the next one isn’t looking so promising.\n\nDuring a recent appearance onThe View, Fishburne explained that his experience with Resurrections didn’t exactly go as hoped, so it’s anyone’s guess what will happen in the future.\n“It depends on the circumstances, who is involved, how well the script has been written. If they offer [it to] me,” the actor said of Matrix 5. “I offered my services to the fourth Matrix, and they didn’t respond well to that. It’s not like I didn’t say, ‘I’d like to offer my services.’ I did. And for whatever reason, that didn’t happen.”\nMorpheus is regarded as one of science fiction's best characters, so it’s interesting that the creatives behind the upcoming film wouldn’t have wanted him to return for The Matrix Resurrections, especially considering he appeared in all three original installments.\nHowever, there could be a fairly simple explanation there: Morpheus dies in the MMO gameThe Matrix Online. That specific event in the game is considered canon because the writer-directors, the Wachowskis, gave their approval to the game.\nThat said, because his death was part of an in-game event, it could very well have been retconned. Instead, Resurrections features Yahya Abdul-Mateen II portraying a version of the character that is actually a hybrid program with Agent Smith created by Neo himself — and also alludes to the fact that the real Morpheus, played by Fishburne, died in the 60 years between the second filmThe Matrix Revolutionsand Resurrections.\nA fifth Matrix film is currently in development with Drew Goddard attached to write and direct.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Jonah Hill's Superbad Character Was So 'Reprehensible' That Sony Insisted He Not Touch a PlayStation During Video Game Scene, Seth Rogan Reveals",
    "publishedAt": "2025-03-13T16:34:51Z",
    "url": "https://www.ign.com/articles/seth-rogan-reveals-jonah-hill-was-banned-from-touching-playstation-in-superbad",
    "full_text": "No video games for you!Superbadco-writerSeth Rogenhas revealed that Sony foundJonah Hill's character so \"reprehensible\" that reps insisted he stay away from aPlayStationduring a video game scene in the now-beloved comedy.\n\n“On Superbad, we were told that Jonah Hill’s character, Seth, was so reprehensible to the studio that they were like, there’s a scene where they’re playing video games and [Sony] was like, ‘Jonah can’t touch a PlayStation,’ ” Rogen told Rotten Tomatoes in a South By Southwest 2025 red carpet video.\n“They were like, ‘We can’t have him interact with our products, because it’s too vile a character.’ And I was like, ‘It’s based on me, that’s very insulting.’ But we accommodated them, ultimately.”\nSony Pictures co-financed the film, so they had a lot of leverage over a few top-notch comics trying to make a generational comedy. Ultimately, instead of Hill’s Seth keysmashing his controller and yelling at the TV screen when he died in-game, Michael Cera’s character Evan can be seen playingThe Getaway: Black Mondayon PS2 in that scene. But fun fact: there’s actually a bit of a gag with one of Cera’s lines here. He mentions using an M16 assault rifle in the game — but The Getaway: Black Monday, a British cop game, doesn’t even include them in the weapons arsenal. Go figure.\nRogen was at SXSW to promote his new Apple TV+ seriesThe Studio, which had its world premiere at the festival just days ago.\nSuperbad also starred Cera, Christopher Mintz-Plasse, and Emma Stone, alongside memorable cameos from Bill Hader and Rogen himself. Rogen co-wrote the script with Evan Goldberg and Greg Mottola directed.\nPhoto by Vince Bucci/Getty Images.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Cancelled Series Star Wars: Underworld Was So Expensive, It Would've 'Blown Up' the Star Wars Universe",
    "publishedAt": "2025-03-13T15:41:23Z",
    "url": "https://www.ign.com/articles/cancelled-series-star-wars-underworld-was-so-expensive-it-wouldve-blown-up-the-star-wars-universe",
    "full_text": "I’m not gonna lie: this one stings. Star Wars prequels producer Rick McCallum recently revealed that the legendary cancelled seriesStar Wars: Underworldwould’ve cost a whopping $40 million per episode to make — effectivelydooming it to be axedfor budget reasons.\n\n“The problem was that each episode was bigger than the films,” McCallum explained in an interview onthe Young Indy Chronicles podcast. “So the lowest I could get it down to with the tech that existed then was $40 million an episode.” McCallum added that the inability to successfully realize the project over the years continues to be “one of the great disappointments of our lives.”\nWith 60 “third draft” scripts written that showcased the Star Wars universe in “sexy, violent, dark, challenging, complicated, and wonderful” ways from “the most wonderful writers in the world,” it seems as though the budget was the true killer in the crib for this project. 60 scripts times $40 million an episode is already well into the $1 billion mark — and it seems as though even George Lucas himself couldn’t scrounge up that kind of cash back in the early 2000s.\n“[It] would’ve blown up the whole Star Wars universe and Disney would’ve definitely never offered George to buy the franchise,” McCallum added. The series was truly axedonce Disney took control of Lucasfilmand Lucas stepped aside.\nThough McCallum did not confirm any plot details during this interview, fans have long believed that the series would coverthe events between Revenge of the Sith and A New Hope. The producer previously revealed that the series would featurea whole new cast of characters, would’ve greatly expanded the Star Wars universe, and was targeting an adult — rather than teen and child — audience.\nStar Wars: Underworld was first revealed at Star Wars Celebration back in 2005 andtest footage from the serieswas leaked in 2020, but since then, that’s all she wrote. Sadly, it looks as though it may just stay that way.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "'Oscar Can Never Be Horizontal' — Conan O'Brien Reveals the Weird Academy Demands for Oscars Statues in Promos",
    "publishedAt": "2025-03-14T17:18:45Z",
    "url": "https://www.ign.com/articles/conan-obrien-reveals-weird-academy-demands-for-oscars-statues-in-promos",
    "full_text": "Today in weird news,recent Oscarshost Conan O’Brien revealed that the Academy of Motion Picture Arts and Sciences refused to allow him and his team to clothe an Oscar statue or lay it horizontally for promotional ads they pitched for the ceremony. Uh, who knewthe Academywas so stuffy?\n\nSpeaking on his Oscars head writer Mike Sweeney’s podcastConan Needs a Friend, O’Brien set the scene: he pitched a series of ads in which he and a 9-foot tall Oscar statue were in a domestic partnership, but the Academy wasn’t exactly receptive to how he wanted to utilize the statue specifically.\n“We’re fighting about things couples fight about,” O’Brien explained of one of his ideas. “At one point, I thought, wouldn’t it be great if it’s just on the couch? Let’s lay it on a really big couch and I’ll be vacuuming and say, ‘Could you at least lift your feet? Or could you at least get up and help? Load the dishwasher?’ We wanted to do it and they just said, ‘No, no no, that can’t happen.’ ”\nFor such a benign — and generally cute — idea, it doesn’t make a ton of sense as to why the Academy was so emphatic about not doing it. But it turns out they have a few super weird rules for their statue iconography.\n“One of the people from the Academy came forward and said, ‘Oscar can never be horizontal.’ And that blew my mind,” O’Brien added. “Like, wow, this is like the thigh bone of St. Peter. This is a religious icon.” The comedian also noted on the podcast that the Academy reps also demanded that the statue is “always naked,” so their idea to have the statue serving O’Brien leftovers as an apron-clad housewife was also a no-go for the organization.\nAgain, there isn’t much sense in these decisions to the naked eye, but the Academy has a right to them all the same. Still, it’s a bummer we couldn’t see the full breadth of O’Brien’s comedic chops in these promos. Hopefully, he’ll come out of the gate with something equally as witty next year — and yes, we’re Team Conan Oscar Host 2026.\nPhoto by Patrick T. Fallon / AFP via Getty Images.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "The Last of Us Season 2 Trailer Breaks HBO Records Nearly a Month Before It Begins",
    "publishedAt": "2025-03-13T14:36:21Z",
    "url": "https://www.ign.com/articles/the-last-of-us-season-2-trailer-breaks-hbo-records",
    "full_text": "Thesecond season of The Last of Ushasn’t even arrived yet, but its looming presence is already making a splash.\n\nThe show’smost recent trailer for Season 2, which was released during a SXSW panel, has garnered over 158 million views across platforms in just three days, according tonumbers provided by Warner Brothers Discovery. The streamer claimed this is a record for HBO and Max original programming, and that this trailer has outperformed previous promos for the show by “at least 160%”\nYou can’t stop this.#TheLastOfUsreturns April 13 on Max.pic.twitter.com/DH8UzAugIV\nThe show seems to only be growing in popularity as fans new and old alike wait patiently for Season 2’s arrival. The Season 1 episodes are averaging “around 32 million cross-platform viewers” domestically, which is a huge jump from the numbers of, say, Season 1’s finale. It racked up an impressive 8.2 million same-day viewers across platforms when it aired in March 2023, according toDeadline. Clearly, folks are excitedly getting ready for the next leg of the story with a little rewatch, but this huge jump in numbers says a lot about just how big this series actually is. It’s definitely one of the most successful for HBO in recent years, but the anticipation and love toward the show is undeniable with numbers like these.\nThe Last of Us will make a five-year time jump for Season 2, and follow Joel and Ellie as they are “drawn into conflict with each other and a world even more dangerous and unpredictable than the one they left behind.” Stars Pedro Pascal, Bella Ramsey, Gabriel Luna, and Rutina Wesley are set to return, with heavy hitters likeKaitlyn Dever, Isabella Merced, Catherine O’Hara, and Jeffrey Wright joining the cast alongside them this season.\nAt the SXSW panel, showrunners Neil Druckmann and Craig Mazin confirmed “spores are back” following their omission from Season 1. The trailer teased the introduction of spores after they were left out of Season 1; we see Ellie, played by Bella Ramsey, view an infected whose breath releases the spores.\nDruckmann said there is \"an escalation of numbers and types of infected, but also, as you see in the trailer, an escalation of the vector of how this thing spreads\" in The Last of Us Season 2, adding: \"Season 1, we had this new thing that wasn’t in the game of these tendrils that spread, and that was one form. And then one shot you see in this trailer, there are things in the air.\"\nMazin later confirmed \"spores are back,\" before Druckmann added: \"The reason [we’re doing it now], I mean, we really wanted to figure it out, and again, everything has to be drama. There had to be a dramatic reason of introducing it now. And there is.\"\nSeason 2 of The Last of Us premieres April 13, 2025 on HBO and HBO Max.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Mike Tyson, Charles Barkley, and More Sports Stars Pay Tribute to Boxing Legend and Grill Master George Foreman, Who Has Died Aged 76",
    "publishedAt": "2025-03-22T09:33:06Z",
    "url": "https://www.ign.com/articles/mike-tyson-charles-barkley-and-more-sports-stars-pay-tribute-to-boxing-legend-and-grill-master-george-foreman-who-has-died-aged-76",
    "full_text": "Boxing legend George Foreman, considered one of the greatest heavyweights of all time and a pop culture icon, has died aged 76.\n\nForeman became a household name for his exploits in the ring, where he won Olympic gold in 1968 aged 19, and the world title twice, the last of which came in 1994 aged 45. Foreman’s iconic fights include Rumble in the Jungle against Muhammad Ali in 1974. He ended his boxing career with an incredible 76 wins and 68 knockouts, losing just five bouts.\nAfter retiring from boxing in 1997, Foreman went on to become a pop culture and TV legend with his grills. A regular face on television ads, Foreman made millions from his ‘George Foreman Grill’ range and tagline \"Lean Mean Grilling Machine.”\nIn a post onInstagram, his family paid tribute: \"Our hearts are broken. With profound sorrow, we announce the passing of our beloved George Edward Foreman Sr. who peacefully departed on March 21, 2025 surrounded by loved ones. A devout preacher, a devoted husband, a loving father, and a proud grand and great grandfather, he lived a life marked by unwavering faith, humility, and purpose.\n\"A humanitarian, an Olympian, and two time heavyweight champion of the world, He was deeply respected — a force for good, a man of discipline, conviction, and a protector of his legacy, fighting tirelessly to preserve his good name — for his family.\n\"We are grateful for the outpouring of love and prayers, and kindly ask for privacy as we honor the extraordinary life of a man we were blessed to call our own.\"\nFormer world heavyweight champion Mike Tyson said Foreman's \"contribution to boxing and beyond will never be forgotten.\"\nCondolences to George Foreman’s family. His contribution to boxing and beyond will never be forgotten.pic.twitter.com/Xs5QjMukqr\nNBA star Charles Barkley told CBS Sports Foreman's death \"hurts a lot.\" \"He was obviously one of the greatest boxers ever, but just a gentle man, he was a pastor — and it just hurts man, plain and simple\", he said. \"My condolences to his family. I’m shook up right now, that caught me so off guard.\"\nCharles Barkley reflects on his relationship with the late George Foremanpic.twitter.com/Bm7HeaRLld\nMagic Johnson saidof Foreman: \"I attended so many of George’s championship fights over his career. He was a knockout artist in the ring, and it was a pleasure getting to know him not only as a boxer but as a man. After leaving the ring, he turned into an amazing businessman — I even bought one of the first George Foreman grills! Cookie and I will be praying for his family during this time.”\nSad news for me and the boxing world... The last boxing pillar for an unforgettable era has passed away today... May his soul rest in peace, Big George Foreman! 💔🥊pic.twitter.com/cufeiEVyom\nForeman married five times and has a dozen children, including five sons who are all named George.\n\"I named all my sons George Edward Foreman so they would always have something in common,\" Foreman wrote on hiswebsite. \"I say to them, 'If one of us goes up, then we all go up together. And if one goes down, we all go down together!' \"\nHe alsofamously said: \"I tell people, 'If you're going to get hit as many times as I've been hit by Muhammad Ali, Joe Frazier, Ken Norton, Evander Holyfield, you're not going to remember many names.' \"\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me."
  },
  {
    "title": "John Carpenter Reveals There's a 'Hint' About Who Turns Into The Thing — And This Fan May Have Worked the Whole Thing Out",
    "publishedAt": "2025-03-24T15:40:12Z",
    "url": "https://www.ign.com/articles/john-carpenter-reveals-theres-a-hint-about-who-turns-into-the-thing-and-this-fan-may-have-worked-the-whole-thing-out",
    "full_text": "Part of the magic of John Carpenter’s legendary 1982 sci-fi horror filmThe Thingis that the ending is left ambiguous. For the past 43 years, fans have wondered whether R.J. MacReady, played by Kurt Russell, or Childs, played by Keith David, turns into the movie’s central monster at the end, but Carpenter intentionally left fans guessing with absolutely no clues to how things shook down — until now.\n\nThe master of horror revealed to Parasite and Mickey 17 director Bong Joon Ho at a special 4K screening of The Thing at the David Geffen Theater in Los Angeles on March 22 thatthere is a “giant hint”in the middle of the film reveals who eventually turns into The Thing at the end of the film. He went on to joke that he would reveal that coveted knowledge to anyone who sent an undisclosed sum of money “in an envelope to my house.”\nCarpenter also told the crowd that the actors themselves didn’t even know who would ultimately end up becoming The Thing. “They had no clue,” he admitted. “But they had to play it human, you see. The creature imitates perfectly. It could be one of us, it could be somebody in the audience, and there’s no way of telling. So I knew, they didn’t know.”\nAs for the hint itself, indie director Joe Russo (notMCU favorite Joe Russo) unleashed his theory on the world via X / Twitter following the screening. “I think I found that hint,”Russo wrote.\nRusso noted that MacReady is told about the notion that the creature can replicate at the cellular level, which means that, for their safety, they should only be eating or drinking things that they alone have had contact with. Despite knowing this crucial detail, MacReady shares his liquor with Childs at the end of the film. This could potentially mean MacReady just forgot what he was told, but in Russo’s theory it more likely means he is, in fact, The Thing. \"As soon as Childs drinks from the bottle, The Thing has won,” Russo says. “It’s beaten its most skeptical, final threat.”\nOf course, the brilliance of Carpenter’s film is that it ends before any of that is confirmed. But Russo offered further supporting evidence. He noted the last line of the film — \"Why don't we just wait here for a little while, see what happens?\" — is very apropos to the situation if MacReady has already become The Thing. The filmmaker’s thread also has an explanation for the moment we see MacReady kill The Thing: “[Did you see that] OR… did you watch a BETTER imitation kill a POORER imitation because it had a better chance of infiltrating society upon rescue.\"\nSome fans were definitely swayed by the theory, while others were stuck on the notion that Childs is the one who becomes the creature. \"I still think it’s Childs because we don’t know his whereabouts for a long time heading into the final scene. But Keith David will tell you he’s 100% not The Thing,\"one fan added to the thread. Russo replied: \"Carpenter said both actors don't know... Childs always felt like a red herring to me.\"\nEither way, it’s definitely a theory worth considering. Carpenter still manages to surprise and delight fans all these years later, and we’re lucky to still be getting bits and pieces of his wisdom.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "The Fantastic Four: First Steps Will Start 'A New Tide of Successful Storytelling' for Marvel, Paul Walter Hauser Says",
    "publishedAt": "2025-03-26T17:24:34Z",
    "url": "https://www.ign.com/articles/the-fantastic-four-first-steps-will-start-a-new-tide-of-successful-storytelling-for-marvel-paul-walter-hauser-says",
    "full_text": "High hopes, high hopes, Paul Walter Hauser is giving us high hopes.The Fantastic Four: First Stepsis on the horizon, and Hauser is hyping up the movie with some extremely choice words that, if proven correct, might mean this is one of the best MCU films in recent years.\n\n\"So I think our movie, Fantastic Four: First Steps, to me, only speaking from my opinion, everything I witnessed and took part in, everything I felt while in the presence of the creatives on the film, I believe we are the Marvel movie of the year,” Hauser, who isplaying a still-undisclosed role in the film, toldTheDirectin a recent interview. “I believe we are the one to watch.\"\nHauser, who is starring in the upcoming filmThe Luckiest Man In America, even went as far as to compare the film to two of the most highly regarded MCU outputs ever. \"And I believe that this will go down in history as one of the ones that started a new tide of successful storytelling for the company,” he added. “Sort of in the same way theGuardians of the GalaxyandBlack Pantherhit. They both hit in a certain way. I believe we are about to hit.\"\nThat said, the Richard Jewell actor also noted that, you know, if itdoesend up being bad, everyone has bad days — I mean, movies. \"Let's remember thatMarvel is servicing a lot of folks, and they want to make a lot of entertainment for people to enjoy, and none of us are 100%. None of us hit the mark every time,” Hauser said. “Not a single one of us. Your favorite director has made a less than satisfactory movie. Just facts.\"\nThe Fantastic Four: First Steps went into development shortly after Josh Trank’s 2015 attempt at a reboot film wasless than the big bang 20th Century Fox was hoping for. After Disney acquired Fox in 2019, the movie was moved to Marvel Studios and officially announced in July of that year. Matt Shakman replaced Jon Watts as director in September 2022, and will helm a script by Josh Friedman, Cameron Squires, Eric Pearson, Peter Cameron, Jeff Kaplan, and Ian Springer.\nVanessa Kirby, Pedro Pascal, Joseph Quinn, and Ebon Moss-Bacarach are set to start as the titular four, with a supporting cast of Hauser, John Malkovitch, Julia Garner, Natasha Lyonne, Sarah Niles, and Ralph Ineson as the villain Galactus alongside them.\nPotentialAI postersaside, The Fantastic Four: First Steps will usher in Phase Six of the MCU and is set to be released in theaters on July 25, 2025. We also knowThe Fantastic Four will turn up in the next Avengers movie, Avengers: Doomsday, now that the cast has been revealed.\nLex Briscuso is a film and television critic and a freelance entertainment writer for IGN. You can follow her on Twitter at @nikonamerica."
  },
  {
    "title": "Horizon Actor Ashly Burch Says Sony's AI Aloy Video Left Her Feeling 'Worried About Game Performance as an Art Form'",
    "publishedAt": "2025-03-17T09:08:48Z",
    "url": "https://www.ign.com/articles/horizon-actor-ashly-burch-says-sonys-ai-aloy-video-left-her-feeling-worried-about-game-performance-as-an-art-form",
    "full_text": "Horizon actor Ashly Burch has addressed the AI Aloy video that leaked online last week, using it to call attention to the demands of striking voice actors.\n\nLast week,The Vergereported on the emergence ofan internal Sony video showing off tech that uses Aloy from the Horizon series to demonstrate AI-powered characters. Sony has yet to respond to IGN’s request for comment.\nIn the now deleted video, Sony Interactive Entertainment director of software engineering, Sharwin Raghoebardajal, has a conversation with an AI-powered Aloy via voice prompts and AI-generated speech and facial animations. Raghoebardajal asks Aloy how she's doing, to which she responds: \"Hello, I'm managing alright. Just dealing with a sore throat. How have you been?\"\nThe voice heard coming from Aloy's mouth is clearly not that of Burch, rather a robotic voice similar to those heard from text-to-speech voice generators. AI Aloy's facial movements are stiff and her eyes appear lifeless as she converses with Raghoebardajal.\nBurch, who has voiced Aloy in all four Horizon video games released so far (Zero Dawn, Forbidden West, Call of the Mountain, and Lego Horizon Adventures) took to social media platform TikTok to confirm that she had seen the video, and that Horizon developer Guerrilla had got in touch to let her know that the tech demo did not reflect anything that was in active development, nor did it use any of Burch’s performance (facial or voice data). That presumably rules out AI Aloy forthe upcoming Horizon multiplayer game, assuming the character is in the game, and the inevitable Horizon 3. However, as Burch pointed out, Guerrilla (and parent company Sony Interactive Entertainment) owns Aloy as a character.\nWith all this in mind, Burch said the AI Aloy video left her feeling “worried about game performance as an art form,” and used it as a jumping off point to discuss the ongoing video game voice actors strike that has claimed a number of high-profile casualties in recent weeks.\nLast week, the Screen Actors Guild - American Federation of Television and Radio Artists (SAG-AFTRA) issued an update to its members on the status of negotiations over video game actor AI protections, saying that while progress had been made, it was still \"frustratingly far apart\" with the industry bargaining group on key issues.\n“Currently what we’re fighting for is, you have to get our consent before you make an AI version of us in any form, you have to compensate us fairly, and you have to tell us how you’re using this AI double,” Burch said.\n“I feel worried not because the technology exists. Not even because game companies want to use it. Of course they do. They always want to use technological advancements. I just imagine a video like this coming out that does have someone’s performance attached to it, that does have someone’s voice or face or movement. And the possibility that if we lose this fight, that person would have no recourse. They wouldn’t have any protections, any way to fight back. And that possibility, it makes me so sad it hurts my heart. It scares me. I love this industry and this art form so much and I want there to be a new generation of actors. I want there to be so many more incredible game performances. I want to be able to continue to do this job. If we don’t win, that future is really compromised.\n“I’m genuinely not trying to put any game company specifically on blast,” Burch continued. “Certainly not Guerrilla. The technology isn’t the problem. Game companies wanting to use the technology isn’t the problem. The problem is we’re currently on strike and the bargaining group will not agree to give us common sense protections.\n“I support the strike. I’ve always supported the strike. I believe fighting is what we have to do to protect the future and the longevity of this career that we all love so much.”\nBurch then pointed to the temporary union contracts that currently give all the protections the striking voice actors are asking for, that any video game company can sign right now. “There’s the interim, the tiered, and low budget agreement contracts available right now for any game company to sign,” Burch said. “I believe we deserve to be protected.”\nlet us speak on AI aloy\nGenerative AI is one of the hottest topics within the video game and entertainment industries, which have both suffered massive layoffs in recent years. It has drawn criticism from players and creators due to a mix of ethical issues, rights issues, and AI’s struggles to produce content audiences actually enjoy. For instance, Keywords Studios attempted to create an experimental game internally using entirely AI.The game failed, with Keywords citing to investors that AI was “unable to replace talent.”\nStill, that hasn’t put off a number of video game companies from using generative AI in the development of their products.Activision recently disclosed the use of generative AI for some Call of Duty: Black Ops 6 assetsas part of new requirements on Steam, amid a backlash to an \"AI slop\" zombie Santa loading screen.\nAnd the voice actor strike has begun to impact a number of video games. Players have reported that games such as Destiny 2 and World of Warcraft appear to have certain NPCs left unvoiced in otherwise voiced scenes, likely due to the strike. Late last year, SAG-AFTRA struck League of Legends after Riotallegedly tried to subvert the strike by canceling a game in response. And Activision confirmedCall of Duty: Black Ops 6 characters were recastafter players expressed concern about new voices.\nJust last week,two Zenless Zone Zero voice actors revealedthey learned they'd been replaced when they saw the game's latest patch notes.\nHead of PlayStation Productions and head of product at PlayStation Studios Asad Qizilbash recentlyweighed in on AI to say its use in video games is important to Gen Z and Gen Alpha gamerswho seek \"personalization across everything.\"\n\"For instance, non-player characters in games could interact with players based on their actions, making it feel more personal,” Qizilbash said. “This is important for the younger Gen Z and Gen Alpha audiences, who are the first generations that grew up digitally and are looking for personalization across everything, as well as looking for experiences to have more meaning.\"\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me."
  },
  {
    "title": "John Wick Anime Film Prequel Will Tell the Story of John Wick’s Impossible Task, Keanu Reeves to Voice Character",
    "publishedAt": "2025-04-01T18:05:00Z",
    "url": "https://www.ign.com/articles/john-wick-anime-film-prequel-will-tell-the-story-of-john-wicks-impossible-task-keanu-reeves-to-voice-character",
    "full_text": "The John Wick anime prequel filmfinally has a confirmed setting.\n\nAnnounced during CinemaCon, the animated movie will see Keanu Reeves return to voice his character. This is in addition toReeves’ just-confirmed return to the role in live-action form for John Wick 5.\nThe animated film prequel will tell the story of John Wick’s legendary ‘Impossible Task,’ which is referenced in the movies as helping to create the mythos — and dread — surrounding Wick’s character.\nHere’s the official blurb:\nIt will be produced by the John Wick producing team of Thunder Road’s Basil Iwanyk and Erica Lee, 87Eleven Entertainment’s Chad Stahelski, and Keanu Reeves. 87Eleven Entertainment’s Alex Young and Jason Spitz will executive produce.\nThe film will be directed by Shannon Tindle, an animation veteran who most recently co-wrote and directed the Annie-nominated Netflix film Ultraman: Rising. Tindle also created the double Oscar nominee Kubo and the Two Strings and served as executive producer/showrunner on the Emmy-winning series Lost Ollie. The film will be written by Vanessa Taylor, writer and co-executive producer of Game of Thrones, writer of Divergent, and an Oscar nominee for her work with Guillermo del Toro on the Best Picture winner The Shape of Water.\nAdam Fogelson, chair of Lionsgate Motion Picture Group, said: “In both animation and the world of John Wick, the possibilities are endless. And there is no John Wick story fans are clamoring for more than the Impossible Task. Shannon’s take on that story is an incredible one, and we are beyond excited to see what John Wick can do in animation.”\nStahelski added: “I’ve always been fascinated with anime. It has always been a huge influence on me, especially with the John Wick series. To have the opportunity to develop a John Wick anime seems to be the perfect progression for the John Wick world. I feel John Wick is the perfect property for this medium — anime holds the potential to expand our world, our characters, and our action in ways unimaginable before.”\nIt’s a massively busy time for the billion dollar John Wick franchise. In addition to the already released four mainline films and the just-announced John Wick 5, the John Wick Universe includes two spinoff films (Ballerina, to be released June 6, and a spinoff directed by and starring Donnie Yen reprising his Caine character, set to start production this summer).\nIn addition, Lionsgate Television produced The Continental: From the World of John Wick for Peacock and Amazon Prime, and Lionsgate confirmed it’s developing the series John Wick: Under the High Table, which Stahelski and Keanu Reeves are executive producing.\nOutside TV and films, Lionsgate recently opened an immersive John Wick experience in Las Vegas and has a John Wick AAA video game in the works.\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me."
  },
  {
    "title": "John Wick 5 Is Official",
    "publishedAt": "2025-04-01T18:04:45Z",
    "url": "https://www.ign.com/articles/john-wick-5-is-official-and-yes-keanu-reeves-is-back-to-give-johns-story-the-proper-next-step",
    "full_text": "John Wick 5is official, with Lionsgate confirming the 60-year-old Keanu Reeves is set to return to the role.\n\nThe announcement was made on-stage during CinemaCon by Adam Fogelson, chair of Lionsgate Motion Picture Group. Development on John Wick: Chapter 5 has begun, with Thunder Road producers Basil Iwanyk and Erica Lee, franchise director and producer Chad Stahelski, and star and producer Keanu Reeves all on-board. No release window was offered.\nWhile it makes sense that yet another mainline John Wick movie would be green lit, given John Wick: Chapter 4 took in over $440 million at the worldwide box office and each of the first four films accomplishing the rare feat of outperforming its predecessor, it perhaps does not make much sense when you consider the ending of John Wick: Chapter 4.\nWarning!Spoilers for John Wick: Chapter 4 follow.\nJohn Wick appears to die at the end of John Wick: Chapter 4 after, once again, defeating the bad guys. We even get to see John Wick’s gravestone, with Winston (Ian McShane) and the Bowery King (Laurence Fishburne) saying their farewells. But, crucially, we only see John Wick collapse from his injuries andappearto die. I don't remember getting a look at the death certificate, let's put it that way.\nSo, how can Reeves continue as Wick? We don’t have story details yet, but we do have quotes from some of the people putting the movie together that confirm this is a continuation of John Wick’s story.\nFogelson said: “Keanu, Chad, Basil, and Erica would not return unless they had something truly phenomenal and fresh to say with these characters and this world. We can’t wait for audiences to see where the journey takes us next.”\nIwanyk and Lee added: “It’s so important to get this story right and give John’s story the proper next step. It’s exciting to take the first step on that road.”\nAs for what a John Wick 5 might entail, check out our breakdown of (spoilers)John Wick: Chapter 4's endingand what it may mean for the future of the franchise. You can also check out IGN's 10/10John Wick: Chapter 4 review.\nIt’s a busy time for the billion dollar John Wick franchise. In addition to the four mainline films, the John Wick Universe, as it’s called, includes two spinoff films (Ballerina, to be released June 6, and a spinoff directed by and starring Donnie Yen reprising his Caine character, set to start production this summer).\nIn addition, Lionsgate Television produced The Continental: From the World of John Wick for Peacock and Amazon Prime, and Lionsgate confirmed it’s developing the series John Wick: Under the High Table, which Stahelski and Keanu Reeves are executive producing.\nOutside TV and films, Lionsgate recently opened an immersive John Wick experience in Las Vegas and has a John Wick AAA video game in the works.\nWesley is the UK News Editor for IGN. Find him on Twitter at @wyp100. You can reach Wesley at wesley_yinpoole@ign.com or confidentially at wyp100@proton.me."
  },
  {
    "title": "The Last of Us Season 2 Review (Spoiler-Free) - IGN",
    "publishedAt": "2025-04-07T16:01:30Z",
    "url": "https://www.ign.com/articles/the-last-of-us-season-2-review-spoiler-free",
    "full_text": "The following is aspoiler-freereview of all seven episodes of The Last of Us Season 2. The first episode premieres on Sunday, April 13 on HBO/Max.\n\nSeason one of HBO’s The Last of Uswas a superb retelling of the Naughty Dog game of the same name, both staying loyal to and enriching a beloved story. But season 2 struggles to replicate those qualities – it’s a bleak, abbreviated chapter whose key moments fall flat with too much regularity. It's by no means bad – in fact, at times it’s very good – it just kept me at arm's length, never letting me quite connect to its characters in the way that’s so crucial to The Last of Us Part 2. It's often a spectacle, crafted with skill throughout, but fails to live up to the thrilling heights of its source material or capture the heart of its first season.\nIf season 1 was about discovering love in the post-apocalypse, season 2 is about holding onto hate, and the more rugged production design reflects this: Fire engulfs snow, melting it away to reveal the fragility of the world these characters inhabit. Five years after Joel (Pedro Pascal) freed Ellie (Bella Ramsey) from the Firefly hospital, we see cities that have fallen apart at the seams, with cult-infused graffiti and showcases of mass murder seemingly on every street corner. It evokes the descent into hell that Ellie goes on, as everything, including the elements, turns against her, with rain pouring and darkness overwhelming sunlight with increasing frequency.\nThis show is dark in every sense of the word, with little aside from a few dad jokes and the occasional love song to lift the gloom. These moments that puncture through the misery and offer hope are always welcome, though, despite how deliberately eye-rolling the punchlines may seem. They’re at the crux of what makes The Last of Us still compelling, if flawed, television this time around.\nI’m not envious of showrunners Neil Druckmann and Craig Mazin. Adapting The Last of Us Part 2 and balancing its many reveals with moments of shocking violence and subtle revelations is a highwire act, indeed. Splitting the game into multiple seasons to adhere to a dual-perspective story that delivers its heaviest hammer blows in flashbacks was always going to be a challenge. For what it's worth, I love Part 2, even more than the original The Last of Us, but watching the HBO version has me questioning just how much of that is due to me being able to actively control its two leads, and just how much beingpartof this story is what makes it work.\nThose coming in fresh may be as equally floored by the way the story is being told here, but I can’t say it fully works for me. I think this is largely due to some big early revelations emerging about newcomer Abby (Kaitlyn Dever). She’s a less compelling presence when she isn’t shrouded in mystery. As a whole, season 2 feels a little stop-start, a startling cadence where momentum quickly ramps up with one action scene after the next, before grinding to a halt with whole episodes dedicated to reflection and remembrance. And with only seven episodes to play with, it struggles to find its rhythm as a result.\nMuch like the first season and The Last of Us Part 1, season two keeps Part 2's larger plot intact. The same events still take place, albeit sometimes presented to us at different junctures, with some expanded upon to add context, but never to the extent that Bill’s story was woven into season 1. That’s not to say there aren’t frequent flashbacks  – they’re often parsed out to give extra context to choices being made or emotions being felt. Pascal continues to portray Joel with an excellent, tearful humanity as he learns to live with his fateful actions in Salt Lake City. Ellie is all that matters to him now, and that’s expertly conveyed by Pascal’s eyes, which work overtime in numerous heartfelt conversations with his surrogate daughter.\nThe jumping back and forth in time is largely successful here, too, filling us in on fresh faces such as Jeffrey Wright’s Isaac – a deliciously performed character who is woefully underexplored in the game. But one episode that takes place almost entirely in the past doesn’t quite work, mainly due to where it falls during the season. The individual scenes are beautifully performed and often tugged my heart in several directions, but it just feels oddly placed in the series as a whole, grinding forward momentum to a halt at a critical point. It then hurtles towards its end in a slightly disorienting fashion, almost deliberately confusing us with fraying threads of subplots leading to other stories that are left dangling.\nThe quieter moments – Bill’s tragic romance, Henry and Sam’s doomed brotherhood – were my favourite in season one and, thankfully, the same can be said for its follow-up. The problem is they’re fewer and further between this time around. Little time is afforded for contemplation, or to form our own interpretation of the characters’ motives. Instead, everything is handed to us in quite an obvious manner, which is to the detriment of a story that should be slaloming through the grey areas of right and wrong. Catherine O’Hara’s therapist character seems mainly present to be a proxy for the audience, but rather than prod us in the right direction and make us think, she frustratingly delivers exposition dumps concerning the people of Jackson’s internal feelings, rather than letting us form our own assessments.\nI fear the pendulum has swung too far from season 1’s scarce encounters with the infected. Hordes and literal avalanches of cordyceps-encrusted monsters descend regularly, especially in the season’s earlier episodes. At one point we’re treated to an almost Helms Deep-like battle sequence in which a flood of infected attempt to wipe out another pocket of humanity; the problem is, this event, although spectacular in its design and execution, overshadows what should be the pivotal moment of the whole season. The catalyst for the rest of its story is reduced almost to a sideshow. It’s a rare miss for a creative team that displayed such elegance in the way it weaved its biggest, most shocking moments into the fabric of season 1.\nAfter a stop-start beginning, the show settles into more of a rhythm (albeit a breakneck one). A familiar feel of deadly road-tripping is resumed, with some of the game’s most threatening foes transferring over to add horror to every dark corner – and providing some of the season’s brightest highlights, too. The midpoint is where it feels most like season 2 is reliving the glory of its predecessor, compared to earlier episodes that strain to fit new characters and Joel and Ellie’s journey into the same spotlight. But The Last of Us gets back on the road soon enough, blending moments of pure horror and touching sentimentality gracefully – episode 4 proved my favourite of the bunch.\nThe pace skips along too breezily for a supposedly grueling suicide mission into an unknown warzone that’s told over the span of just seven episodes. What should feel like Martin Sheen's long ordeal in Apocalypse Now is presented more like a whistlestop tour of Seattle landmarks. Ultimately, the only hearts of darkness here belong to the many people who have chosen violence as a way of life – a reality seemingly inescapable for any citizen of post-apocalypse Seattle.\nTribalism is at the core of this season, and indeed the core theme that resonates through its source material. Seattle has its warring factions, and Jackson is a tribe all of its own. The problem is that Ellie has never been one for authority, stretching back to her FEDRA training days and subsequent betrayal of the fireflies at the hands of Joel. Personal ties are what powers her choices, and the internal conflict between selfishness and selflessness is keenly explored. This is aided by Ellie’s new friends Jesse and Dina, who are played fantastically by Young Mazino and Isabela Merced, respectively.\nGabriel Luna is the early episodes’ MVP. His Tommy is the rock of Jackson: tender but strong, and the cool to his often hotheaded and impulsive brother, Joel. But it’s the charismatic Merced who’s the star of the show in season 2. As Dina, she’s a great source of warmth and humour throughout – as much as can be found in this world, anyway. A fun (bordering on jarringly quippy) foil to Ellie, she gives as good as she gets but also stands strong in their many encounters with Clickers and other such threats. (And when the time comes, she knows to just run away, too.) Between this andAlien Romulus, she’s proven that she’s perfectly at home being chased by monsters.\nBella Ramsey was fantastic as a younger version of Ellie, but their performance in season 2 didn’t really sell me on the fact that five years have passed in the world of The Last of Us. Ellie just doesn’t appear to have matured, and it sits strangely next to the very mature content of season 2. Ramsey acts with more physicality, displaying impressive combat skills, but still behaves like a child in conversation. They’re great most of the time, but in the flashes of rage they’re asked to present, it feels slightly off –  especially now that Abby is around: In the brief moments we spend with her, Kaitlyn Dever is a force. Ramsey mostly remains a strong interpreter of Ellie, and they’re superb at the precocious, cheeky side of the character, but upstaged by Dever in the show’s more heated moments  – she’s simply able to deal a more ferocious shade of heat.\nOn a production level, The Last of Us remains a near-faultless display of prestige television. Beautifully shot, it captures both the scale of the depravity taking hold over nature and presents both the beautiful and horrific details that inhabit it. The lighting stands out in particular: Sentimental moments are drenched in warm sunlight, while horror is often (and appropriately) bathed in blood-red hues or hand-lit by the flame of stalking threats. At its best, the atmosphere sparks images of Ben Wheatley's thriller-come-folk horror masterpiece, Kill List, as it merges modern architecture with thoroughly medieval, violent practices – an ominous, cultlike religious group introduced in season 2 only adds to this air of doom.\nBut this is a story barely half-told, and as such is hard to evaluate. The further into Seattle we get, the more we’re getting scraps of things we won’t see in their entirety until later on. It could be that by the end of season 3, these seven episodes feel like an exciting piece of a greater whole. The problem is, this is television, and we’ll have to wait many months, if not years, for those gaps to be filled in. I fear, for all that makes season 2 worth recommending, it will leave a lot of people bewildered rather than intrigued. I ultimately respect the decision to largely stick with the game’s structure – it's part of what makes the steady reveal of its story and our evolving sympathies towards its characters such a masterstroke. I’m just wary that the effect hasn’t translated all too well here.\nIt was always going to be a challenge to adapt The Last of Us Part 2’s sprawling, twisting story into a television show across multiple seasons, and at the halfway point, the jury is still out on whether it will ultimately work. Season 2 of HBO’s Naughty Dog adaptation is not bad television, far from it. It’s incredibly well-made, often looks gorgeous, and is packed full of stellar performances. But the storytelling devices and choices made in terms of pace and placement for key events bump up against what works, ultimately not delivering the striking effect this story’s undeniable shocking events should. It’s good, just not a patch on its stellar source material (or its first season) so far."
  }
]